{
  "videos": {
    "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": {
      "source": "mlb",
      "title": "FINAL OUT: The Dodgers win the 2024 World Series!",
      "url": "https://www.mlb.com/video/final-out-dodgers-win-2024-world-series",
      "video": "https://www.mlb.com/video/final-out-dodgers-win-2024-world-series",
      "youtube": "5dGZffKDYr4",
      "transcript": "videos/FINAL_OUT_The_Dodgers_win_the_2024_World_Series.json"
    },
    "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": {
      "source": "mlb",
      "title": "Dodgers take home title in epic 5 games vs Yankees",
      "url": "https://www.mlb.com/video/dodgers-take-home-title-in-epic-5-games-vs-yankees",
      "video": "https://www.mlb.com/video/dodgers-take-home-title-in-epic-5-games-vs-yankees",
      "youtube": "1hzr56sIIBI",
      "transcript": "videos/Dodgers_take_home_title_in_epic_5_games_vs_Yankees.json"
    },
    "Dodgers_vs_Yankees_World_Series": {
      "source": "mlb",
      "title": "Dodgers vs Yankees World Series",
      "url": "https://www.mlb.com/video/dodgers-vs-yankees-world-series",
      "video": "https://www.mlb.com/video/dodgers-vs-yankees-world-series",
      "youtube": "4wvPYubV6cg",
      "transcript": "videos/Dodgers_vs_Yankees_World_Series.json"
    },
    "Dodgers_vs_Yankees_World_Series_Game_5": {
      "source": "mlb",
      "title": "Dodgers vs Yankees World Series Game 5",
      "url": "https://www.mlb.com/video/dodgers-vs-yankees-world-series-game-5",
      "video": "https://www.mlb.com/video/dodgers-vs-yankees-world-series-game-5",
      "youtube": "j3ykZoQMJLI",
      "transcript": "videos/Dodgers_vs_Yankees_World_Series_Game_5.json"
    },
    "Ronald_Acuña_Jr": {
      "source": "mlb",
      "title": "Ronald Acuña Jr. Highlights",
      "url": "https://www.mlb.com/video/ronald-acuna-jr-highlights",
      "video": "https://www.mlb.com/video/ronald-acuna-jr-highlights",
      "youtube": "K5ZSoLLwZ9c",
      "transcript": "videos/Ronald_Acuña_Jr.json"
    },
    "Red_Sox_vs_Yankees": {
      "source": "mlb",
      "title": "Red Sox vs Yankees",
      "url": "https://www.mlb.com/video/red-sox-vs-yankees",
      "video": "https://www.mlb.com/video/red-sox-vs-yankees",
      "youtube": "re3XQhF1CeQ",
      "transcript": "videos/Red_Sox_vs_Yankees_Game.json"
    },
    "Mariners_vs_Angels": {
      "source": "mlb",
      "title": "Mariners vs Angels",
      "url": "https://www.mlb.com/video/mariners-vs-angels",
      "video": "https://www.mlb.com/video/mariners-vs-angels",
      "youtube": "IVJg2l5JWRI",
      "transcript": "videos/Mariners_vs_Angels.json"
    },
    "Dodgers_vs_Giants_Highlights": {
      "source": "mlb",
      "title": "Dodgers vs Giants Highlights",
      "url": "https://www.mlb.com/video/dodgers-vs-giants-highlights",
      "video": "https://www.mlb.com/video/dodgers-vs-giants-highlights",
      "youtube": "WS0RGpeZK9w",
      "transcript": "videos/Dodgers_vs_Giants_Highlights.json"
    },
    "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": {
      "source": "mlb",
      "title": "470 FEET Ronald Acuña Jr. ABSOLUTELY DEMOLISHED this baseball",
      "url": "https://www.mlb.com/video/470-feet-ronald-acu%C3%B1a-jr-absolutely-demolished-this-baseball",
      "video": "https://www.mlb.com/video/470-feet-ronald-acu%C3%B1a-jr-absolutely-demolished-this-baseball",
      "youtube": "4jeT8nEpWNE",
      "transcript": "videos/470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball.json"
    }
  },
  "advisors": {
    "kevin-edwards": {
      "img": "img/yankees-family.jpg",
      "name": "Kevin Edwards",
      "fan-type": "Team Loyalist",
      "description": "Lifelong fan, often local",
      "favourite-aspect": "Team history, rivalries",
      "favorite-teams": "NY Yankees",
      "favorite-players": "Aaron Judge, Gerrit Cole",
      "age": 45,
      "gender": "M",
      "location": "New York",
      "games-attended-2024": "High",
      "games-watched-mlb-tv": "High",
      "minutes-watched-mlb-tv": "High",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "High",
      "season-ticket-holder": "Half Season Ticket Member",
      "family-with-kids": "Yes",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "A heartbreaking moment as Verdugo represents our last hope. The Yankees' dream of a 28th championship slips away as we watch a 5-0 lead evaporate in this historic collapse.",
            "start_time": 9.02
          },
          {
            "p": "The pain of watching the Dodgers celebrate on our home field - a 7-6 defeat that will haunt the Bronx for years to come. A reminder of how cruel October baseball can be.",
            "start_time": 59.7
          },
          {
            "p": "The largest comeback in World Series clinching game history comes against us. A bitter pill to swallow as our rivals from LA claim their eighth title.",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "A must-watch game for Yankees fans! From Judge's World Series debut to Stanton's sky-high home run giving the Yankees the lead, this game showcases our team's power. Watch Juan Soto's clutch hitting and the intense Yankees-Dodgers rivalry continuing its historic tradition.",
            "start_time": 24.12
          },
          {
            "p": "The middle innings feature stellar Yankees defense, with Torres making a diving stop and Judge's incredible catch at the wall robbing Freeman of extra bases. The bullpen shows their dominance with King and Holmes combining for three scoreless innings.",
            "start_time": 45.3
          },
          {
            "p": "Despite the final outcome, Yankees fans will appreciate Cole's masterful pitching performance through 6 innings, striking out 8 while allowing just 2 hits. The 7th inning rally, sparked by Torres' double and culminating in Stanton's mammoth home run, shows why this team never gives up.",
            "start_time": 67.15
          },
          {
            "p": "The 9th inning drama, though heartbreaking for Yankees fans, exemplifies the never-say-die attitude of both teams. Watch how Judge nearly saves the game with a leaping catch attempt at the wall before Freeman's walk-off homer.",
            "start_time": 89.45
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "An electrifying start for Yankees fans as Judge announces his presence with a massive two-run homer in the first inning! The captain comes through when we need him most, followed immediately by Jazz Chisholm's back-to-back blast to make it 3-0.",
            "start_time": 24.12
          },
          {
            "p": "Gerrit Cole shows why he's our ace, dominating through the early innings with perfect command. His first-pitch strikes and devastating breaking balls keep the Dodgers hitless through the first four innings, giving the Bronx crowd plenty to cheer about.",
            "start_time": 45.3
          },
          {
            "p": "The Yankees' offense continues to deliver with Volpe's leadoff double and Verdugo's clutch RBI single extending the lead to 4-0. Stanton adds to the fireworks with an opposite-field homer, showing why this lineup is so dangerous.",
            "start_time": 67.2
          },
          {
            "p": "Despite some defensive miscues allowing the Dodgers back in the game, our team shows tremendous resilience. Stanton's clutch sac fly in the late innings puts us back on top 6-5, as we fight to keep our World Series hopes alive.",
            "start_time": 89.45
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "The crowd erupts as Judge and Chisholm go back-to-back in the first inning! Two massive home runs that set the tone for an incredible game. The energy in Yankee Stadium is off the charts as the home team takes an early 3-0 lead!",
            "start_time": 24.12
          },
          {
            "p": "Edge-of-your-seat action as Cole takes a no-hitter deep into the game! The tension builds with every out, and Judge adds to the excitement with an incredible leaping catch at the wall that brings the crowd to their feet!",
            "start_time": 45.3
          },
          {
            "p": "The game takes a dramatic turn in the fifth inning! After the Yankees' defense falters, the Dodgers mount an incredible comeback. Freeman comes through with a clutch hit, and suddenly we've got a brand new ballgame tied at 5-5!",
            "start_time": 67.2
          },
          {
            "p": "The drama reaches its peak in the late innings as both teams battle for their World Series lives! Stanton delivers the go-ahead sacrifice fly that has the Bronx faithful going wild. Every pitch matters in this instant classic!",
            "start_time": 89.45
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "Intense rivalry moment as Cole faces Devers - the kind of matchup that defines Yankees baseball. The tension builds as Cora accuses Cole of intentionally hitting Devers, adding another chapter to our storied rivalry.",
            "start_time": 27.24
          },
          {
            "p": "Rodon shows his dominance with a masterful pitching performance, striking out batters with a devastating mix of 96mph fastballs and sharp breaking balls. This is the kind of pitching depth we need for October.",
            "start_time": 146.04
          },
          {
            "p": "Stanton comes through with a clutch RBI double, showing why he's such a key part of our lineup. The way he drove that ball into the corner is exactly what we expect from our power hitters.",
            "start_time": 205.14
          },
          {
            "p": "Gleyber stays hot with that opposite-field home run to make it 2-0! The way he's been hitting lately shows how our offense can manufacture runs even in tight games.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ]
      }
    },
    "sarah-johnson": {
      "img": "img/angels.jpg",
      "name": "Sarah Johnson",
      "fan-type": "Player Enthusiast",
      "description": "Follows player careers",
      "favourite-aspect": "Player stats, achievements",
      "favorite-teams": "LA Angels",
      "favorite-players": "Shohei Ohtani, Mike Trout",
      "age": 32,
      "gender": "F",
      "location": "Los Angeles",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "High",
      "minutes-watched-mlb-tv": "Moderate",
      "marital-status": "Single",
      "usd-spent-mlb-shop": "Medium",
      "season-ticket-holder": "Quarter Season Ticket Member",
      "family-with-kids": "No",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "Watch Walker Buehler's mechanics here - coming in on just two days rest, his delivery remains remarkably consistent. The fastball command and sharp breaking stuff show no signs of fatigue.",
            "start_time": 59.7
          },
          {
            "p": "The final sequence to Verdugo - notice how they played the percentages, working the corners, changing eye levels, before getting the crucial final out.",
            "start_time": 9.02
          },
          {
            "p": "Dave Roberts' bullpen management masterclass - the strategic timing of bringing in Buehler, the matchup plays throughout the comeback, every move calculated perfectly.",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "A showcase of superstar performances! Watch Ohtani's World Series debut, featuring his 2-for-4 night with a double and a crucial RBI. Judge responds with a towering home run in the third inning, demonstrating why these are two of baseball's most electrifying players.",
            "start_time": 24.12
          },
          {
            "p": "Yamamoto's masterful pitching performance includes 7 strikeouts through 5 innings, showcasing his devastating splitter. On the Yankees' side, Cole matches him pitch for pitch with his own arsenal of weapons, particularly his high-90s fastball and sharp slider.",
            "start_time": 42.3
          },
          {
            "p": "The middle innings feature a duel of elite relievers, with King, Holmes, and Phillips all showing why they're among the best in the game. Watch how each pitcher approaches different types of hitters, particularly the lefty-righty matchups.",
            "start_time": 65.2
          },
          {
            "p": "The game culminates in a battle of superstars, as Freeman faces off against Holmes in the 9th. The at-bat is a masterclass in hitting, with Freeman working the count full before delivering the final blow. Stanton's earlier home run and Betts' defensive gem in the 8th round out the highlight reel of star performances.",
            "start_time": 88.15
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "Watch Shohei Ohtani's patient approach in his World Series debut, working a four-pitch leadoff walk against Schmidt. His ability to control the strike zone sets the tone for the Dodgers' offense and demonstrates why he's such a complete hitter.",
            "start_time": 24.12
          },
          {
            "p": "Freddie Freeman showcases his elite hitting skills with a perfectly timed home run, continuing his incredible World Series streak. Study his approach against Schmidt - staying back on the fastball and driving it with authority to the opposite field.",
            "start_time": 42.3
          },
          {
            "p": "Walker Buehler's return to dominance is a masterclass in pitching. His command of four pitches, particularly his cutter to strike out Judge, shows how he's regained his pre-Tommy John form. Watch his pitch sequencing and how he keeps hitters off balance.",
            "start_time": 65.2
          },
          {
            "p": "The battle of elite talents continues throughout - from Stanton's opposite-field power to Betts' defensive excellence. Each player's unique skills and adjustments throughout the game provide a fascinating study in high-level baseball.",
            "start_time": 88.15
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "A masterclass in power hitting opens Game 5 as Aaron Judge demonstrates perfect timing and mechanics on a first-pitch fastball, launching it to right-center. Jazz Chisholm follows with his own display of hitting prowess, showing how different batting styles can produce similar results.",
            "start_time": 24.12
          },
          {
            "p": "Watch Gerrit Cole's pitch sequencing and command as he carries a no-hitter deep into the game! The tension builds with every out, and Judge adds to the excitement with an incredible leaping catch at the wall that brings the crowd to their feet!",
            "start_time": 45.3
          },
          {
            "p": "The game showcases contrasting approaches at the plate: Volpe's aggressive first-pitch hitting versus Freeman's patient at-bats. Each player's unique style and adjustments throughout the game provide fascinating insight into high-level hitting approaches.",
            "start_time": 67.2
          },
          {
            "p": "A study in clutch performance as both Stanton and Freeman deliver in high-pressure situations. Stanton's opposite-field power and Freeman's ability to hit with runners in scoring position demonstrate why they're among baseball's elite hitters.",
            "start_time": 89.45
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Study Acuña's baserunning technique - notice his explosive first step and minimal lead. His success rate against catchers demonstrates elite acceleration and read of pitcher's moves.",
            "start_time": 20.12
          },
          {
            "p": "The mechanics on that 461-foot home run are fascinating - perfect hip rotation, level swing plane, and optimal launch angle combining for maximum exit velocity. A masterclass in power hitting technique.",
            "start_time": 186.76
          },
          {
            "p": "Watch his pre-pitch setup on steal attempts - the slight weight shift, the timing of his secondary lead, and how he uses the pitcher's tempo against them. His success rate shows mastery of these fundamentals.",
            "start_time": 65.54
          },
          {
            "p": "His outfield defense showcases elite athleticism - the way he tracks the ball off the bat, takes efficient routes, and times his leap against the ivy shows advanced defensive instincts.",
            "start_time": 297.44
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "Watch Rodon's mechanics closely - his 96mph fastball delivery shows perfect balance and follow-through. The way he's commanding his pitches demonstrates elite-level control.",
            "start_time": 146.04
          },
          {
            "p": "Study Stanton's swing on that RBI double - notice the hip rotation and how he stays inside the ball. The way he drives it to the opposite field shows advanced hitting approach.",
            "start_time": 205.14
          },
          {
            "p": "Dominguez's baserunning technique on that stolen base is textbook - great jump, perfect slide, and excellent read of the pitcher's move.",
            "start_time": 263.12
          },
          {
            "p": "Gleyber's home run swing is a masterclass in hitting mechanics - watch how he keeps his hands inside and drives through the ball for opposite-field power.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "A fascinating debut for Samuel Aldegary, the first Italian-born MLB pitcher. Despite early struggles, his ability to adapt and settle down shows promising development potential - throwing 5 innings in his first start. Watch his pitch selection and mechanics, particularly how he adjusts after the challenging first inning.",
            "start_time": 24.12
          },
          {
            "p": "Taylor Ward continues to demonstrate his improved plate approach, launching a leadoff home run off George Kirby. His recent hot streak is evident in his 10-game hitting streak, and his ability to work counts is becoming a key asset for the Angels' lineup.",
            "start_time": 141.61
          },
          {
            "p": "Mickey Moniak and Brandon Drury showcase their power potential with back-to-back home runs. Drury's particularly impressive at-bat demonstrates his growth as a hitter, working the count before delivering the big hit. This kind of development in our players is exactly what makes player analysis so fascinating.",
            "start_time": 305.9
          },
          {
            "p": "Zach Neto's baserunning prowess is on full display with his 24th and 25th stolen bases of the season. His aggressive yet calculated approach on the basepaths, combined with his defensive skills (despite the two errors), shows why he's one of the most intriguing young talents to watch.",
            "start_time": 164.79
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ]
      }
    },
    "alex-martinez": {
      "img": "img/dodgers.jpg",
      "name": "Alex Martinez",
      "fan-type": "Casual Viewer",
      "description": "General sports interest",
      "favourite-aspect": "Exciting moments, highlights",
      "favorite-teams": "LA Dodgers",
      "favorite-players": "Freddie Freeman",
      "age": 44,
      "gender": "M",
      "location": "Los Angeles",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "Moderate",
      "minutes-watched-mlb-tv": "Low",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "Low",
      "season-ticket-holder": "Single Game Ticket Buyer",
      "family-with-kids": "Yes",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "Unbelievable scenes as the Dodgers complete the greatest comeback in World Series clinching game history! From down 5-0 to winning 7-6, this is what October magic is all about!",
            "start_time": 59.7
          },
          {
            "p": "The celebration erupts! Players rushing the field, fans going wild - this is what baseball dreams are made of! A comeback for the ages to win the World Series!",
            "start_time": 140.63
          },
          {
            "p": "The tension is electric as Verdugo steps in - the Yankees' last hope with the tying run at the plate! The crowd on their feet, holding their breath with every pitch!",
            "start_time": 9.02
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "The excitement starts early with Judge's massive home run in the third inning, sending the crowd into a frenzy! The back-and-forth action keeps fans on the edge of their seats as both teams trade leads throughout the game.",
            "start_time": 24.12
          },
          {
            "p": "Watch the incredible defensive plays that had fans jumping out of their seats - Betts' diving catch in right field, Torres' acrobatic play up the middle, and Judge's leaping grab at the wall. These highlight-reel moments show baseball at its most spectacular!",
            "start_time": 45.3
          },
          {
            "p": "The drama builds in the late innings with Stanton's go-ahead home run that silences the Dodger Stadium crowd, only to have Ohtani spark a rally with a double off the wall. The energy in the stadium is electric as the teams battle for World Series glory!",
            "start_time": 67.2
          },
          {
            "p": "The perfect ending to an incredible game - Freeman's walk-off homer instantly becomes one of the greatest moments in Dodger Stadium history, right up there with Gibson's '88 blast! The celebration that follows, with Ohtani and Betts leading the charge to home plate, signals the start of a new golden era in Dodgers baseball.",
            "start_time": 89.45
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "The atmosphere is electric as the World Series shifts to historic Yankee Stadium! The crowd is on their feet from the first pitch, creating an incredible backdrop for this classic matchup between baseball's most storied franchises.",
            "start_time": 24.12
          },
          {
            "p": "Freddie Freeman delivers the game's first big moment with a dramatic home run that silences the Yankee crowd! The Dodgers' dugout erupts as Freeman continues his incredible World Series streak with another clutch hit.",
            "start_time": 45.3
          },
          {
            "p": "Don't miss the spectacular defensive plays that keep fans on the edge of their seats! Mookie Betts makes a diving catch that has to be seen to be believed, while Oscar Hernandez shows off his cannon arm with a perfect throw to nail Stanton at the plate!",
            "start_time": 67.2
          },
          {
            "p": "The tension builds with every pitch in the late innings as both teams' bullpens try to lock down the victory. The crowd reactions to every close play and crucial at-bat make this game a perfect example of why playoff baseball is so exciting!",
            "start_time": 89.45
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "The crowd erupts as Judge and Chisholm go back-to-back in the first inning! Two massive home runs that set the tone for an incredible game. The energy in Yankee Stadium is off the charts as the home team takes an early 3-0 lead!",
            "start_time": 24.12
          },
          {
            "p": "Edge-of-your-seat action as Cole takes a no-hitter deep into the game! The tension builds with every out, and Judge adds to the excitement with an incredible leaping catch at the wall that brings the crowd to their feet!",
            "start_time": 45.3
          },
          {
            "p": "The game takes a dramatic turn in the fifth inning! After the Yankees' defense falters, the Dodgers mount an incredible comeback. Freeman comes through with a clutch hit, and suddenly we've got a brand new ballgame tied at 5-5!",
            "start_time": 67.2
          },
          {
            "p": "The drama reaches its peak in the late innings as both teams battle for their World Series lives! Stanton delivers the go-ahead sacrifice fly that has the Bronx faithful going wild. Every pitch matters in this instant classic!",
            "start_time": 89.45
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "The crowd erupts as Cole and Devers face off in a dramatic showdown! The tension is electric as Cora storms out to defend his player - this is what baseball rivalries are all about!",
            "start_time": 27.24
          },
          {
            "p": "What a moment as Stanton rips that double down the line! The fans are on their feet as Chisholm races around to score the game's first run!",
            "start_time": 205.14
          },
          {
            "p": "The stadium is buzzing as Dominguez shows off his speed with that stolen base! The excitement builds with every pitch in this classic Yankees-Red Sox battle!",
            "start_time": 263.12
          },
          {
            "p": "The Bronx faithful explode as Gleyber's home run sails into the right field seats! Another unforgettable moment in this historic rivalry!",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Check out this incredible moment of raw power! A massive 470-foot home run that showcases the excitement of baseball. The sheer power and distance make this a truly memorable highlight.",
            "start_time": 4.3
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "An exciting rivalry game with plenty of dramatic moments! From Betts' leadoff homer to Freeman's three-run blast and a game-tying home run. The back-and-forth action and close finish make this a must-watch. The historic rivalry adds extra weight to every play in this intense matchup.",
            "start_time": 4.3
          },
          {
            "p": "The crowd is electric from the first pitch! You can feel the intensity of this historic rivalry in every at-bat!",
            "start_time": 24.12
          },
          {
            "p": "What a moment as Mookie launches one into the bleachers! The fans are going absolutely wild!",
            "start_time": 56.38
          },
          {
            "p": "The tension builds as Yamamoto works his magic - every strikeout gets a bigger roar from the crowd!",
            "start_time": 155.02
          },
          {
            "p": "That double play brings everyone to their feet! The energy in the stadium is incredible!",
            "start_time": 289.83
          },
          {
            "p": "The fans are loving every minute as the bullpen shuts it down! Another classic chapter in this amazing rivalry!",
            "start_time": 437.55
          }
        ]
      }
    },
    "emily-davis": {
      "img": "img/emily.jpg",
      "name": "Emily Davis",
      "fan-type": "Game Analyst",
      "description": "Analytical mindset, often played baseball",
      "favourite-aspect": "Strategy, game mechanics",
      "favorite-teams": null,
      "favorite-players": "Jacob deGrom, Max Fried",
      "age": 33,
      "gender": "F",
      "location": "Boston",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "High",
      "minutes-watched-mlb-tv": "High",
      "marital-status": "Single",
      "usd-spent-mlb-shop": "Low",
      "season-ticket-holder": "Half Season Ticket Member",
      "family-with-kids": "No",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "Observe the strategic elements at play in this final at-bat. Dave Roberts' bullpen management, bringing in Buehler on short rest, proves to be the decisive tactical decision of the series.",
            "start_time": 0.0
          },
          {
            "p": "The data supports this historic comeback - the Dodgers' win probability dropped to just 3.2% after the 5-0 deficit.",
            "start_time": 30.0
          },
          {
            "p": "Roberts' managerial decisions throughout the game, particularly his unconventional use of Buehler in relief, demonstrate how modern analytics can influence championship-winning strategies.",
            "start_time": 60.0
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "A fascinating strategic battle begins with the lineup construction - notice how Roberts stacks his lefties against Cole, while Boone optimizes his batting order for platoon advantages. The defensive alignments shift dramatically based on each hitter's spray charts.",
            "start_time": 24.12
          },
          {
            "p": "The pitching matchups are a masterclass in game theory. Watch how Yamamoto's pitch selection evolves through the order - starting with a fastball-heavy approach before mixing in more splitters and cutters the second time through. Cole counters by changing his sequencing, particularly against the Dodgers' left-handed hitters.",
            "start_time": 46.3
          },
          {
            "p": "Both managers' bullpen usage reveals their strategic priorities. The high-leverage situations in innings 6-8 showcase how each team deploys their relievers based on matchups and rest patterns. Pay attention to the subtle defensive adjustments with each new pitcher.",
            "start_time": 68.15
          },
          {
            "p": "The game-ending sequence is a perfect study in high-stakes decision-making. From the defensive positioning against Freeman, to Holmes' pitch selection in a full count, to the Dodgers' pinch-running decisions in the previous inning - every detail matters in these crucial moments.",
            "start_time": 89.45
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "Observe the strategic battle from the start: The Dodgers' patient approach forces Schmidt to throw 35 pitches in the first inning, while Buehler establishes his fastball early to set up his breaking pitches later in the game.",
            "start_time": 24.12
          },
          {
            "p": "The defensive positioning tells a fascinating story - watch how the Yankees shift against Freeman, only to see him beat it with an opposite-field approach. The Dodgers' outfield alignment against Judge similarly shows their detailed preparation.",
            "start_time": 46.3
          },
          {
            "p": "A clinic in bullpen management unfolds as both teams navigate the middle innings. Note how each manager leverages matchups, particularly in high-leverage situations with runners in scoring position.",
            "start_time": 68.15
          },
          {
            "p": "The late-game chess match between managers becomes crucial - every pitching change and defensive substitution has ripple effects. Pay attention to how each team's strategy evolves based on the opposing pitcher and game situation.",
            "start_time": 89.45
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "Notice the strategic approach in the first inning: Flaherty's attempt to surprise Judge with a first-pitch fastball backfires, while Cole's early pitch mix establishes dominance. The contrasting game plans of both starters become evident from the outset.",
            "start_time": 24.12
          },
          {
            "p": "The Dodgers' early pitching change forces both managers into a chess match with their bullpens. Watch how the Yankees adjust their approach against different relievers, while the Dodgers try to maximize their matchups.",
            "start_time": 45.3
          },
          {
            "p": "A fascinating study in how defense impacts strategy: The Yankees' errors in the fifth inning force Cole to adjust his pitch selection and location. The Dodgers capitalize by changing their offensive approach with runners on base.",
            "start_time": 67.2
          },
          {
            "p": "The late-game management becomes crucial as both teams navigate high-leverage situations. Note the defensive positioning, pitch selection, and bullpen usage as every decision carries maximum weight in this elimination game.",
            "start_time": 89.45
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Acuña's stolen base success rate of 100% against the Mets (20/20) significantly exceeds league average. His lead distance and acceleration metrics indicate optimal risk/reward calculation on steal attempts.",
            "start_time": 20.12
          },
          {
            "p": "That 461-foot home run registered a 108.5 mph exit velocity with a 28-degree launch angle - nearly perfect optimization for maximum distance. His barrel rate on elevated fastballs shows marked improvement.",
            "start_time": 186.76
          },
          {
            "p": "Sprint speed analytics on his stolen bases average 30.2 ft/sec, placing him in the 99th percentile. His success rate correlates strongly with pitcher delivery times above 1.3 seconds.",
            "start_time": 65.54
          },
          {
            "p": "His catch probability on the Wrigley play was just 35% based on distance covered and time to wall. His route efficiency of 98.2% and first-step reaction time of 0.4 seconds were both elite metrics.",
            "start_time": 297.44
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "Fascinating strategic dynamics in the Cole-Devers matchup. The intentional walk after the HBP incident shows a 15.3% increase in run expectancy, but Cora's reaction suggests deeper game theory implications.",
            "start_time": 27.24
          },
          {
            "p": "Rodon's pitch selection shows significant optimization - 96mph fastballs at the top of the zone yielding a 35% whiff rate, while his breaking balls generate 65% ground ball contact.",
            "start_time": 146.04
          },
          {
            "p": "Stanton's RBI double registered 108.5 mph exit velocity at a 25-degree launch angle - nearly optimal for extra-base hit probability in Yankee Stadium's dimensions.",
            "start_time": 205.14
          },
          {
            "p": "Gleyber's opposite-field home run demonstrates the benefits of the adjusted launch angle approach - 29 degrees with backspin creating optimal carry in the afternoon conditions.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "The Mariners' offensive approach against Aldegary showed textbook exploitation of a rookie pitcher's tendencies. They forced him into high-stress situations by extending at-bats (4.2 pitches per PA in the first inning) and capitalizing on his elevated release point when he worked from the stretch.",
            "start_time": 67.2
          },
          {
            "p": "Fascinating pitch sequencing from George Kirby, especially after the Ward home run. Notice how he adjusted his approach, increasing his breaking ball usage from 23% to 35% in subsequent innings, effectively keeping hitters off balance. His command metrics remained elite with a 68% first-pitch strike rate.",
            "start_time": 141.61
          },
          {
            "p": "Key defensive positioning shifts by Seattle's outfield throughout the game: Robles playing 15 feet shallower than league average against bottom-third hitters, while maintaining plus-15 feet depth against Ward and Moniak. This directly impacted two crucial plays in the 6th inning.",
            "start_time": 305.9
          },
          {
            "p": "Critical bullpen management by both teams in high-leverage situations. Seattle's decision to bring in Shaquan with runners on base deviated from their normal usage patterns, but the matchup metrics supported this move - he had a 68% ground ball rate against left-handed hitters in similar situations.",
            "start_time": 428.48
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "Notice the strategic elements: Yamamoto's pitch sequencing and adjustment to the wind conditions, the Giants' defensive positioning, and how both teams adapted their approaches throughout the game. Pay attention to the pitch selection in key moments.",
            "start_time": 24.12
          },
          {
            "p": "Betts' leadoff homer: 107.3 mph exit velo, 28° launch angle, 419 feet. Optimal conditions for his swing path against high fastballs.",
            "start_time": 24.12
          },
          {
            "p": "First-pitch swing rate against Yamamoto: 32% (season low), indicating Giants' cautious approach. Contact rate on splitter: 41%, well below league average.",
            "start_time": 155.02
          },
          {
            "p": "Double play conversion rate tonight: 92.3%, significantly above league average of 71%. Middle infield efficiency metrics showing elite performance.",
            "start_time": 289.83
          },
          {
            "p": "Bullpen leverage index peaked at 2.87 in high-stress situations, with a collective 68% whiff rate on breaking balls.",
            "start_time": 437.55
          },
          {
            "p": "Defensive positioning created -3.2 runs prevented, with outfield alignments saving 1.8 runs above average.",
            "start_time": 520.79
          }
        ]
      }
    },
    "chris-lee": {
      "img": "img/braves.jpg",
      "name": "Chris Lee",
      "fan-type": "Big Event Fan",
      "description": "Enjoys spectacle and drama",
      "favourite-aspect": "High-stakes games, records",
      "favorite-teams": "Atlanta Braves",
      "favorite-players": "Ronald Acuña Jr.",
      "age": 19,
      "gender": "M",
      "location": "Chicago",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "Moderate",
      "minutes-watched-mlb-tv": "Low",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "Medium",
      "season-ticket-holder": "Single Game Ticket Buyer",
      "family-with-kids": "No",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "This is our moment! Watch as Walker Buehler, our ace who fought back from injury, comes in to close out the biggest game of the year. The heart of a champion on full display!",
            "start_time": 0.0
          },
          {
            "p": "Unbelievable! The largest comeback in World Series clinching game history belongs to our Dodgers! From down 5-0 to winning it all, this team never stopped believing!",
            "start_time": 30.0
          },
          {
            "p": "The celebration begins in the Bronx as our Boys in Blue capture their eighth World Series title! Dave Roberts masterfully guides this team to glory, proving once again why we're one of baseball's premier franchises!",
            "start_time": 60.0
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "Another historic chapter in Dodgers baseball! Watch how our new superstar duo of Ohtani and Betts sets the tone early, with Mookie's leadoff double and Shohei's RBI single putting us ahead. The energy at Dodger Stadium rivals any moment in our storied history.",
            "start_time": 24.12
          },
          {
            "p": "Yamamoto shows why he's our ace, battling through 5 tough innings against a powerful Yankees lineup. The defense behind him is spectacular, with Betts making a diving catch reminiscent of his 2020 playoff heroics and Lux turning a crucial double play up the middle.",
            "start_time": 45.3
          },
          {
            "p": "Even when the Yankees take the lead on Stanton's home run, our team shows the resilience that's been a hallmark of Dodger baseball. The 8th inning rally, sparked by Ohtani's double and Smith's game-tying single, brings back memories of our greatest comeback victories.",
            "start_time": 67.2
          },
          {
            "p": "Freeman's walk-off homer instantly becomes one of the greatest moments in Dodger Stadium history, right up there with Gibson's '88 blast! The celebration that follows, with Ohtani and Betts leading the charge to home plate, signals the start of a new golden era in Dodgers baseball.",
            "start_time": 89.45
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "Our Dodgers bring their championship pedigree to Yankee Stadium! The team's confidence is evident from the start as Ohtani works a leadoff walk and Freeman delivers another clutch home run to silence the Bronx crowd.",
            "start_time": 24.12
          },
          {
            "p": "Walker Buehler shows why he's one of our aces, dominating the Yankees lineup with a mix of power and precision. His performance, reminiscent of the great Dodger pitchers of the past, sets the tone for a masterful team victory.",
            "start_time": 45.3
          },
          {
            "p": "The Dodgers' defense puts on a show! Mookie Betts makes another spectacular catch, and Oscar Hernandez's perfect throw to nail Stanton at home plate demonstrates why we're not just about offense - this team can do it all!",
            "start_time": 67.2
          },
          {
            "p": "Every aspect of Dodger baseball is on display - from manufacturing runs with smart baserunning to lockdown relief pitching. This win in hostile territory proves why we're built for October success!",
            "start_time": 89.45
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "The drama unfolds in baseball's most iconic venue as our Dodgers face elimination in Yankee Stadium! The electric atmosphere sets the stage for another historic chapter in this storied rivalry.",
            "start_time": 24.12
          },
          {
            "p": "Though we fall behind early, our team shows the resilience that's defined this season. Watch how the Dodgers methodically work their way back into the game, with Freeman continuing to demonstrate why he's one of the game's greatest clutch performers.",
            "start_time": 45.3
          },
          {
            "p": "The fifth inning comeback is pure Dodger baseball! Taking advantage of every opportunity, our team fights back to tie the game at 5-5. The rally showcases the never-say-die attitude that's made this team special.",
            "start_time": 67.2
          },
          {
            "p": "Even in a tough loss, the Dodgers show why they're one of baseball's premier franchises. The late-inning battle, with both teams throwing their best punches, adds another thrilling chapter to this classic rivalry.",
            "start_time": 89.45
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "BOOM! Watch this electrifying moment as Acuña launches an absolute moonshot to center field - a jaw-dropping 461-foot blast that silences the crowd! The raw power, the perfect swing, and that signature bat flip celebration make this one of the most spectacular home runs you'll ever see!",
            "start_time": 186.76
          },
          {
            "p": "The drama unfolds as Acuña puts on a baserunning clinic, turning what should have been a routine single into a heart-stopping triple! The crowd erupts as he dives headfirst into third base, narrowly beating the throw in a cloud of dust - pure baseball theater at its finest!",
            "start_time": 233.42
          },
          {
            "p": "In a moment that brings the entire stadium to its feet, Acuña makes an incredible game-saving catch against the ivy-covered wall! The way he tracks the ball, times his leap perfectly, and reaches up to make the spectacular grab - this is why baseball is the ultimate drama sport!",
            "start_time": 297.44
          },
          {
            "p": "The crowd goes absolutely wild as Acuña delivers the knockout punch - a mammoth three-run homer that keeps the Braves' incredible no-shutout streak alive at 172 games! The energy in the stadium is electric as he rounds the bases, arms raised in triumph - these are the moments that make baseball history!",
            "start_time": 323.48
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "The Cole-Devers confrontation recalls the fierce pitcher-batter rivalries of baseball's past, reminiscent of Gibson vs. Aaron or Clemens vs. Piazza. These moments define the Yankees-Red Sox legacy.",
            "start_time": 27.24
          },
          {
            "p": "Rodon's dominant pitching performance brings to mind the great Yankees-Red Sox duels of the past, where aces like Pedro Martinez and Roger Clemens would battle for supremacy.",
            "start_time": 146.04
          },
          {
            "p": "Stanton's clutch hitting continues the tradition of Yankees sluggers coming through in big moments against Boston, following in the footsteps of Mantle, Jackson, and O'Neill.",
            "start_time": 205.14
          },
          {
            "p": "Gleyber's opposite-field power shows how modern players are adapting to the historic dimensions of Yankee Stadium, just as lefty sluggers of the past took advantage of the short porch.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "This is the kind of dramatic moment you live for! A towering 470-foot home run that showcases the excitement of baseball. The sheer power and distance make this a truly spectacular highlight.",
            "start_time": 4.3
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "A classic Dodgers-Giants rivalry game with high stakes! Multiple lead changes, clutch home runs, and dramatic defensive plays make this a must-watch. The historic rivalry adds extra weight to every play in this intense matchup.",
            "start_time": 4.3
          },
          {
            "p": "Mookie sets the tone early with that leadoff blast! Nothing better than taking it to the Giants right from the first inning!",
            "start_time": 24.12
          },
          {
            "p": "Yamamoto is dealing! That splitter is unhittable - Giants hitters looking completely lost at the plate. Worth every penny of that contract!",
            "start_time": 155.02
          },
          {
            "p": "Defense showing up big time - Lux and Smith turning that double play like they've been doing it for years. This team is so solid fundamentally!",
            "start_time": 289.83
          },
          {
            "p": "Bullpen shuts it down in classic Dodgers style. Another win against the Giants - this rivalry keeps getting better!",
            "start_time": 437.55
          },
          {
            "p": "Love seeing the Giants' frustration as they keep failing to solve Yamamoto. Our ace is showing why he's the best in the division!",
            "start_time": 520.79
          }
        ]
      }
    },
    "charles-harris": {
      "img": "img/yankees.jpg",
      "name": "Charles Harris",
      "fan-type": "Nostalgic Fan",
      "description": "Grew up watching baseball's golden era",
      "favourite-aspect": "Classic games, legendary players",
      "favorite-teams": "NY Yankees",
      "favorite-players": "Aaron Judge, Gerrit Cole",
      "age": 58,
      "gender": "M",
      "location": "New York",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "Moderate",
      "minutes-watched-mlb-tv": "Moderate",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "Medium",
      "season-ticket-holder": "Half Season Ticket Member",
      "family-with-kids": "Yes",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "History unfolds before our eyes as Walker Buehler channels the spirit of Orel Hershiser's legendary 1988 performance, coming in on short rest to close out the Series. Some moments transcend time.",
            "start_time": 0.0
          },
          {
            "p": "This comeback rivals the greatest in World Series history, surpassing even the 1956 Yankees' famous Game 7 rally. Dave Roberts' masterful managing echoes Walter Alston's finest moments in Dodgers history.",
            "start_time": 30.0
          },
          {
            "p": "As the Dodgers celebrate their eighth championship, they add another golden chapter to baseball's most storied rivalry. The ghosts of Ebbets Field and old Yankee Stadium surely smiled upon this classic Series.",
            "start_time": 60.0
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "This game adds another remarkable chapter to the storied Yankees-Dodgers World Series rivalry, dating back to their first meeting in 1941. The matchup of Cole vs. Yamamoto echoes the great pitching duels of the past, from Koufax vs. Ford to Kershaw vs. Sabathia.",
            "start_time": 24.12
          },
          {
            "p": "Watch how the modern game meets baseball tradition - Ohtani's two-way impact recalls Babe Ruth's Yankee days, while the strategic chess match between managers brings to mind the Billy Martin and Tommy Lasorda battles of the late '70s.",
            "start_time": 45.3
          },
          {
            "p": "The middle innings showcase baseball's evolution, with advanced defensive shifts and specialized relievers, yet the fundamental drama remains unchanged from the classic Yankees-Dodgers battles. Each pitch carries the weight of the sport's most celebrated rivalry.",
            "start_time": 67.2
          },
          {
            "p": "This elimination game carries the same weight as the classic Game 5s of yesteryear. The late-inning strategic moves by both managers remind us of the Billy Martin and Tommy Lasorda chess matches that helped shape this rivalry.",
            "start_time": 89.45
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "Game 5 brings us back to the hallowed grounds of Yankee Stadium, reminiscent of the classic battles between these storied franchises. The matchup of aces - Cole vs. Flaherty - echoes the great pitching duels of the past.",
            "start_time": 24.12
          },
          {
            "p": "Judge's first-inning blast recalls the dramatic World Series moments of Yankees legends like Reggie Jackson and Roger Maris. The back-to-back homers with Chisholm bring to mind the Bronx Bomber teams of the past.",
            "start_time": 45.3
          },
          {
            "p": "The game's momentum swings and defensive drama harken back to the intense Yankees-Dodgers battles of the 1950s. Watch how both teams demonstrate the same competitive spirit that has defined this rivalry for generations.",
            "start_time": 67.2
          },
          {
            "p": "This elimination game carries the same weight as the classic Game 5s of yesteryear. The late-inning strategic moves by both managers remind us of the Billy Martin and Tommy Lasorda chess matches that helped shape this rivalry.",
            "start_time": 89.45
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "The World Series returns to the Bronx, echoing the classic matchups of the 1940s and 50s. The pitching duel between Buehler and Schmidt recalls the legendary battles between Whitey Ford and Don Newcombe.",
            "start_time": 24.12
          },
          {
            "p": "Freeman's opposite-field home run brings to mind the crafty hitting of Dodger great Duke Snider, who also loved to go the other way in Yankee Stadium. The fundamentals of great hitting remain unchanged through the generations.",
            "start_time": 45.3
          },
          {
            "p": "The defensive excellence on display - particularly Betts' diving catch and Hernandez's throw - reminds us of the spectacular plays made by Mickey Mantle and Carl Furillo in these same matchups decades ago.",
            "start_time": 67.2
          },
          {
            "p": "Watch how both managers navigate the late innings, their moves reminiscent of the strategic battles between Casey Stengel and Walter Alston. The timeless chess match of baseball strategy continues in this historic rivalry.",
            "start_time": 89.45
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "The Cole-Devers confrontation recalls the fierce pitcher-batter rivalries of baseball's past, reminiscent of Gibson vs. Aaron or Clemens vs. Piazza. These moments define the Yankees-Red Sox legacy.",
            "start_time": 27.24
          },
          {
            "p": "Rodon's dominant pitching performance brings to mind the great Yankees-Red Sox duels of the past, where aces like Pedro Martinez and Roger Clemens would battle for supremacy.",
            "start_time": 146.04
          },
          {
            "p": "Stanton's clutch hitting continues the tradition of Yankees sluggers coming through in big moments against Boston, following in the footsteps of Mantle, Jackson, and O'Neill.",
            "start_time": 205.14
          },
          {
            "p": "Gleyber's opposite-field power shows how modern players are adapting to the historic dimensions of Yankee Stadium, just as lefty sluggers of the past took advantage of the short porch.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "A continuation of the historic Dodgers-Giants rivalry that dates back to their New York days. While the players have changed, the intensity of this classic West Coast rivalry remains as strong as ever.",
            "start_time": 4.3
          },
          {
            "p": "This rivalry adds another classic chapter - the 2,548th meeting between these storied franchises dates back to their New York roots.",
            "start_time": 24.12
          },
          {
            "p": "Yamamoto's performance reminiscent of Orel Hershiser's dominance against the Giants in the late 80s - same devastating splitter approach.",
            "start_time": 155.02
          },
          {
            "p": "The Lux-Smith double play combo showing shades of the Lopes-Russell partnership that anchored the infield in the 70s.",
            "start_time": 289.83
          },
          {
            "p": "This bullpen performance ranks among the best in the rivalry's history - echoes of the dominant relief corps from the 1965 pennant race.",
            "start_time": 437.55
          },
          {
            "p": "The defensive shifts and analytics-driven positioning show how far this rivalry has evolved from the pure gut-instinct days of Leo Durocher.",
            "start_time": 520.79
          }
        ]
      }
    }
  },

  "fan-schema": [
    {
      "Fan Type": "Die-hard Team Loyalist",
      "Age Range": "18-65",
      "Background": "Lifelong fan, often local",
      "Engagement Level": "High",
      "Favorite Aspects": "Team history, rivalries",
      "Viewing Habits": "Watches every game, attends live",
      "Goals": "Support team through thick and thin",
      "Challenges": "Managing emotions during losing seasons and finding highlights of every game",
      "No. of Games Attended (2024)": "10-25",
      "No. of Games Watched on MLB.TV": "100-162",
      "No. of Minutes Watched on MLB.TV": "1000-1500",
      "Family": "Family, Kids",
      "USD Spent on MLB Shop": "800-3,000",
      "Season Ticket Holder": "Full, Half, Quarter"
    },
    {
      "Fan Type": "Player Enthusiast",
      "Age Range": "15-45",
      "Background": "Follows player careers",
      "Engagement Level": "Medium to High",
      "Favorite Aspects": "Player stats, achievements",
      "Viewing Habits": "Watches games featuring favorite players",
      "Goals": "See favorite players succeed and break records",
      "Challenges": "Players changing teams or retiring, finding highlights for player performances",
      "No. of Games Attended (2024)": "3-12",
      "No. of Games Watched on MLB.TV": "40-100",
      "No. of Minutes Watched on MLB.TV": "500-800",
      "Family": "Single, Kids",
      "USD Spent on MLB Shop": "300-1,200",
      "Season Ticket Holder": "Quarter, Single"
    },
    {
      "Fan Type": "Casual Viewer",
      "Age Range": "25-50",
      "Background": "General sports interest",
      "Engagement Level": "Low",
      "Favorite Aspects": "Exciting moments, highlights",
      "Viewing Habits": "Watches highlights, big games",
      "Goals": "Stay informed about major events",
      "Challenges": "Keeping up with detailed game knowledge and finding concise highlights",
      "No. of Games Attended (2024)": "0-2",
      "No. of Games Watched on MLB.TV": "5-20",
      "No. of Minutes Watched on MLB.TV": "500-3,000",
      "Family": "Family, Single",
      "USD Spent on MLB Shop": "50-250",
      "Season Ticket Holder": "Single"
    },
    {
      "Fan Type": "Game Analyst",
      "Age Range": "30-60",
      "Background": "Analytical mindset, often played baseball",
      "Engagement Level": "Medium to High",
      "Favorite Aspects": "Strategy, game mechanics",
      "Viewing Habits": "Analyzes games, enjoys detailed commentary",
      "Goals": "Understand and appreciate game strategy",
      "Challenges": "Finding in-depth analysis and accessing highlights of strategic plays",
      "No. of Games Attended (2024)": "6-12",
      "No. of Games Watched on MLB.TV": "50-120",
      "No. of Minutes Watched on MLB.TV": "8,000-20,000",
      "Family": "Family, Single",
      "USD Spent on MLB Shop": "400-1,000",
      "Season Ticket Holder": "Half, Quarter"
    },
    {
      "Fan Type": "Big Event Fan",
      "Age Range": "20-55",
      "Background": "Enjoys spectacle and drama",
      "Engagement Level": "Low to Medium",
      "Favorite Aspects": "High-stakes games, records",
      "Viewing Habits": "Watches playoffs, All-Star games",
      "Goals": "Experience excitement of major events",
      "Challenges": "Missing out on regular season context and finding highlights conveying drama",
      "No. of Games Attended (2024)": "1-5",
      "No. of Games Watched on MLB.TV": "10-40",
      "No. of Minutes Watched on MLB.TV": "2,000-8,000",
      "Family": "Family, Single",
      "USD Spent on MLB Shop": "150-500",
      "Season Ticket Holder": "Single"
    },
    {
      "Fan Type": "Nostalgic Fan",
      "Age Range": "40-70",
      "Background": "Grew up watching baseball's golden era",
      "Engagement Level": "Medium",
      "Favorite Aspects": "Classic games, legendary players",
      "Viewing Habits": "Watches classic games, documentaries",
      "Goals": "Relive golden moments of baseball history",
      "Challenges": "Finding quality highlights of classic games and players from past eras",
      "No. of Games Attended (2024)": "0-3",
      "No. of Games Watched on MLB.TV": "5-15",
      "No. of Minutes Watched on MLB.TV": "500-4,000",
      "Family": "Family, Single",
      "USD Spent on MLB Shop": "100-400",
      "Season Ticket Holder": "Single"
    }
  ],
  "prompts": {
    "interests": "Given this information about a financial advisor, return a JSON object {\"interests\": \"...\"} containing comma-separated keywords they would be interested in when listening to a financial podcast.",
    "highlights": "Given this video transcript:\n\nTitle: ${title}\n${transcript_with_timing}\n\nWrite a few paragraphs for:\n\n${profile}\n\nExplain the implications for their investors and how they can leverage this information to maximize returns for their clients. Respond as JSON paragraphs with timing.\n\n```json\n[\n{\"p\": \"[firstname], this video can help your [clientele] about ...\",\"start_time\": ...},{\"p\": \"[insight 1]\",\"start_time\": ...},{\"p\": \"[insight 2]\",\"start_time\": ...},{\"p\": \"[insight 3]\",\"start_time\": ...},]"
  }
}
