{
  "videos": {
    "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": {
      "source": "mlb",
      "title": "FINAL OUT: The Dodgers win the 2024 World Series!",
      "url": "https://www.mlb.com/video/final-out-dodgers-win-2024-world-series",
      "video": "https://www.mlb.com/video/final-out-dodgers-win-2024-world-series",
      "youtube": "5dGZffKDYr4",
      "transcript": "assets/videos/FINAL_OUT_The_Dodgers_win_the_2024_World_Series.json"
    },
    "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": {
      "source": "mlb",
      "title": "World Series Cinematic Recap: Dodgers take home title in epic 5 games vs. Yankees",
      "url": "https://www.mlb.com/video/dodgers-take-home-title-in-epic-5-games-vs-yankees",
      "video": "https://www.mlb.com/video/dodgers-take-home-title-in-epic-5-games-vs-yankees",
      "youtube": "1hzr56sIIBI",
      "transcript": "assets/videos/Dodgers_take_home_title_in_epic_5_games_vs_Yankees.json"
    },
    "Dodgers_vs_Yankees_World_Series": {
      "source": "mlb",
      "title": "Dodgers vs Yankees World Series",
      "url": "https://www.mlb.com/video/dodgers-vs-yankees-world-series",
      "video": "https://www.mlb.com/video/dodgers-vs-yankees-world-series",
      "youtube": "4wvPYubV6cg",
      "transcript": "assets/videos/Dodgers_vs_Yankees_World_Series.json"
    },
    "Dodgers_vs_Yankees_World_Series_Game_5": {
      "source": "mlb",
      "title": "Dodgers vs Yankees World Series Game 5",
      "url": "https://www.mlb.com/video/dodgers-vs-yankees-world-series-game-5",
      "video": "https://www.mlb.com/video/dodgers-vs-yankees-world-series-game-5",
      "youtube": "j3ykZoQMJLI",
      "transcript": "assets/videos/Dodgers_vs_Yankees_World_Series_Game_5.json"
    },
    "Ronald_Acuña_Jr": {
      "source": "mlb",
      "title": "Ronald Acuña Jr. Highlights",
      "url": "https://www.mlb.com/video/ronald-acuna-jr-highlights",
      "video": "https://www.mlb.com/video/ronald-acuna-jr-highlights",
      "youtube": "K5ZSoLLwZ9c",
      "transcript": "assets/videos/Ronald_Acuña_Jr.json"
    },
    "Red_Sox_vs_Yankees": {
      "source": "mlb",
      "title": "Red Sox vs Yankees",
      "url": "https://www.mlb.com/video/red-sox-vs-yankees",
      "video": "https://www.mlb.com/video/red-sox-vs-yankees",
      "youtube": "re3XQhF1CeQ",
      "transcript": "assets/videos/Red_Sox_vs_Yankees.json"
    },
    "Mariners_vs_Angels": {
      "source": "mlb",
      "title": "Mariners vs Angels",
      "url": "https://www.mlb.com/video/mariners-vs-angels",
      "video": "https://www.mlb.com/video/mariners-vs-angels",
      "youtube": "IVJg2l5JWRI",
      "transcript": "assets/videos/Mariners_vs_Angels.json"
    },
    "Dodgers_vs_Giants_Highlights": {
      "source": "mlb",
      "title": "Dodgers vs Giants Highlights",
      "url": "https://www.mlb.com/video/dodgers-vs-giants-highlights",
      "video": "https://www.mlb.com/video/dodgers-vs-giants-highlights",
      "youtube": "WS0RGpeZK9w",
      "transcript": "assets/videos/Dodgers_vs_Giants_Highlights.json"
    },
    "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": {
      "source": "mlb",
      "title": "470 FEET Ronald Acuña Jr. ABSOLUTELY DEMOLISHED this baseball",
      "url": "https://www.mlb.com/video/470-feet-ronald-acu%C3%B1a-jr-absolutely-demolished-this-baseball",
      "video": "https://www.mlb.com/video/470-feet-ronald-acu%C3%B1a-jr-absolutely-demolished-this-baseball",
      "youtube": "4jeT8nEpWNE",
      "transcript": "assets/videos/470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball.json"
    }
  },
  "advisors": {
    "kevin-edwards": {
      "img": "assets/img/yankees-family.jpg",
      "name": "Kevin Edwards",
      "fan-type": "Die-hard Team Loyalist",
      "description": "Background: Lifelong fan, often local | Favourite Aspects: Team history, rivalries | Viewing Habits: Watches every game, attends live | Goals: Support team through thick and thin",
      "favourite-aspect": "Team history, rivalries",
      "favorite-teams": "NY Yankees",
      "favorite-players": "Aaron Judge, Gerrit Cole",
      "age": 45,
      "gender": "M",
      "location": "New York",
      "games-attended-2024": "High",
      "games-watched-mlb-tv": "High",
      "minutes-watched-mlb-tv": "High",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "High",
      "season-ticket-holder": "Half Season Ticket Member",
      "family-with-kids": "Yes",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "<strong>Final Hope</strong>: Standing here in Yankee Stadium, the weight of history bears down as Verdugo steps to the plate. As a lifelong fan who's witnessed countless crucial moments in this ballpark, the tension is unbearable. Our hopes for championship number 28 rest on his shoulders, with the ghosts of Yankees past watching from Monument Park.",
            "start_time": 9.02
          },
          {
            "p": "<strong>Historic Heartbreak</strong>: This historic collapse from a 5-0 lead cuts deep into every Yankees fan's heart. Having attended nearly every home game this season, watching our bitter rivals from LA complete the largest comeback in World Series clinching game history in our house is devastating. The rivalry that began in Brooklyn continues to haunt us.",
            "start_time": 59.7
          },
          {
            "p": "<strong>Pinstripe Pride</strong>: The sight of the Dodgers celebrating on our sacred ground - a 7-6 defeat that will join the painful chapters of our storied rivalry. As a die-hard fan who bleeds pinstripes, this moment stings, but like the 27 championships before, we'll add this to our motivation. The Yankees always rise again.",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "<strong>Yankees Pride</strong>: Our journey to the Fall Classic began with Juan Soto's electrifying three-run blast! As a die-hard fan who's witnessed every playoff game this season, seeing the Yankees clinch their first pennant since '09 brought tears to my eyes. The ghosts of Yankees past were surely smiling!",
            "start_time": 36.58
          },
          {
            "p": "<strong>Historic Showdown</strong>: The 12th Yankees-Dodgers World Series! The weight of history fills Yankee Stadium as we face our oldest rivals. From the days of DiMaggio vs. Robinson to Judge vs. Ohtani, this matchup always brings out the best in baseball. Every Yankees fan knows - this is more than just a series.",
            "start_time": 99.44
          },
          {
            "p": "<strong>Championship Spirit</strong>: Game 4's grand slam by Volpe, a true Bronx moment! The Stadium erupting as our rookie shortstop, born and raised in New York, delivers under pressure. That's Yankees baseball - when our backs are against the wall, we fight back hardest. The pride of the pinstripes shining through!",
            "start_time": 394.19
          },
          {
            "p": "<strong>Heartbreaking Finale</strong>: From Judge's blast to build that early 5-0 lead, we dared to dream. But watching it slip away in our own house... the pain cuts deep. Yet even in defeat, we showed the heart of champions. We'll be back - 28 is still coming. The Yankees never stay down for long.",
            "start_time": 540.06
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "Our rivalry with the Dodgers is the stuff of baseball legend - from the Subway Series of the 40s and 50s to our epic battles in '77 and '81. This matchup brings back memories of legendary Yankees moments. Now it's our turn to add another chapter to this historic rivalry.",
            "start_time": 26.7
          },
          {
            "p": "Every pitch, every at-bat carries the weight of our storied rivalry with the Dodgers. From the subway series of the 40s and 50s to our epic battles in '77 and '81, this matchup brings back memories of legendary Yankees moments. Now it's our turn to add another chapter to this historic rivalry.",
            "start_time": 96.14
          },
          {
            "p": "The Stadium is packed with the most passionate fans in baseball, creating that signature October atmosphere that's uniquely Yankees. You can feel the presence of our 27 championships, with Monument Park standing as a reminder of the legends who've worn the pinstripes in games just like this.",
            "start_time": 199.08
          },
          {
            "p": "This series isn't just about winning - it's about upholding the legacy of Ruth, Gehrig, DiMaggio, and Mantle. Every Yankees fan knows that anything less than a championship isn't enough. We're here to bring home number 28, adding another golden chapter to baseball's most illustrious franchise.",
            "start_time": 324.70
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "Our ace Gerrit Cole takes the mound in the biggest game of the year, with the weight of Yankee history on his shoulders. The electricity in Yankee Stadium is palpable as we fight to keep our championship hopes alive. This is what being a Yankees fan is all about - the pressure, the history, the chance for greatness.",
            "start_time": 18.0
          },
          {
            "p": "Judge and Chisholm Jr. send the Bronx into a frenzy with back-to-back bombs! The Stadium is shaking as we take an early 3-0 lead. This is Yankees baseball at its finest - power hitting in October, just like the days of Ruth and Gehrig, Mantle and Maris.",
            "start_time": 31.76
          },
          {
            "p": "Cole is dealing like a true Yankees ace, painting the corners and showing why he's the heir to our incredible pitching legacy. Every strikeout brings back memories of Whitey Ford in the '50s and Ron Guidry in '78. This is the kind of performance that adds to the Yankees' championship mystique.",
            "start_time": 159.58
          },
          {
            "p": "The tension mounts as we try to protect our lead in the late innings. Every pitch, every play carries the weight of 27 championships behind it. The ghosts of Yankees past seem to be watching as we battle to force a Game 6 and keep the dream of number 28 alive.",
            "start_time": 722.57
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Not Relevant",
            "start_time": null
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "Intense rivalry moment as Cole faces Devers - the kind of matchup that defines Yankees baseball. The tension builds as Cora accuses Cole of intentionally hitting Devers, adding another chapter to our storied rivalry.",
            "start_time": 27.24
          },
          {
            "p": "Rodon shows his dominance with a masterful pitching performance, striking out batters with a devastating mix of 96mph fastballs and sharp breaking balls. This is the kind of pitching depth we need for October.",
            "start_time": 146.04
          },
          {
            "p": "Stanton comes through with a clutch RBI double, showing why he's such a key part of our lineup. The way he drove that ball into the corner is exactly what we expect from our power hitters.",
            "start_time": 205.14
          },
          {
            "p": "Gleyber stays hot with that opposite-field home run to make it 2-0! The way he's been hitting lately shows how our offense can manufacture runs even in tight games.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ]
      }
    },
    "sarah-johnson": {
      "img": "assets/img/angels.jpg",
      "name": "Sarah Johnson",
      "fan-type": "Player Enthusiast",
      "description": "Background: Follows favourite player career and only the teams they play in| Favourite Aspects: Player stats, achievements | Viewing Habits: Watches games featuring favorite players | Goals: See favorite players succeed and break records",
      "favourite-aspect": "Player stats, achievements",
      "favorite-teams": "LA Angels, LA Dodgers",
      "favorite-players": "Shohei Ohtani, Mike Trout",
      "age": 32,
      "gender": "F",
      "location": "Los Angeles",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "High",
      "minutes-watched-mlb-tv": "Moderate",
      "marital-status": "Single",
      "usd-spent-mlb-shop": "Medium",
      "season-ticket-holder": "Quarter Season Ticket Member",
      "family-with-kids": "No",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "<strong>Championship Moment</strong>: What a perfect ending to Shohei's first Dodgers season! His impact on this team went beyond statistics - the energy he brought to the dugout, the way he elevated everyone's game. This championship cements his legacy as one of baseball's most transformative players.",
            "start_time": 172.67
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "<strong>Ohtani's Moment</strong>: Shohei's first World Series appearance! After years of following his incredible journey, seeing him on baseball's biggest stage is pure magic. His presence alone transforms the Dodgers lineup, and you can feel the electricity every time he steps to the plate.",
            "start_time": 36.58
          },
          {
            "p": "<strong>Star Power</strong>: The matchup we've been waiting for - Ohtani vs Judge! Two of baseball's most electrifying players facing off in the World Series. Their contrasting styles and incredible talents make this series must-watch baseball for any true fan of the game.",
            "start_time": 162.98
          },
          {
            "p": "<strong>Clutch Performance</strong>: Ohtani showing his baserunning brilliance! Taking the extra base and advancing to third on a slightly misplayed ball - this is why he's the most complete player in baseball. His aggressive baserunning creates opportunities even when the hits aren't falling.",
            "start_time": 238.44
          },
          {
            "p": "<strong>Championship Dreams</strong>: What a journey for Shohei - from dominating in Japan to winning his first World Series! His passion for the game shines through in every at-bat, every baserunning decision. This is why we love baseball - watching generational talents achieve their dreams on the biggest stage.",
            "start_time": 701.24
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "A masterclass in power hitting opens Game 5 as Aaron Judge demonstrates perfect timing and mechanics on a first-pitch fastball, launching it to right-center. Jazz Chisholm follows with his own display of hitting prowess, showing how different batting styles can produce similar results.",
            "start_time": 24.12
          },
          {
            "p": "Watch Gerrit Cole's pitch sequencing and command as he carries a no-hitter deep into the game! The tension builds with every out, and Judge adds to the excitement with an incredible leaping catch at the wall that brings the crowd to their feet!",
            "start_time": 45.3
          },
          {
            "p": "The game showcases contrasting approaches at the plate: Volpe's aggressive first-pitch hitting versus Freeman's patient at-bats. Each player's unique style and adjustments throughout the game provide fascinating insight into high-level hitting approaches.",
            "start_time": 67.2
          },
          {
            "p": "A study in clutch performance as both Stanton and Freeman deliver in high-pressure situations. Stanton's opposite-field power and Freeman's ability to hit with runners in scoring position demonstrate why they're among baseball's elite hitters.",
            "start_time": 89.45
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Sorry Acuña, Sarah only has eyes for Ohtani and Trout! Check back when you're wearing an Angels or Dodgers uniform ",
            "start_time": null
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "A fascinating debut for Samuel Aldegary, the first Italian-born MLB pitcher. Despite early struggles, his ability to adapt and settle down shows promising development potential - throwing 5 innings in his first start. Watch his pitch selection and mechanics, particularly how he adjusts after the challenging first inning.",
            "start_time": 24.12
          },
          {
            "p": "Taylor Ward continues to demonstrate his improved plate approach, launching a leadoff home run off George Kirby. His recent hot streak is evident in his 10-game hitting streak, and his ability to work counts is becoming a key asset for the Angels' lineup.",
            "start_time": 141.61
          },
          {
            "p": "Zach Neto's baserunning prowess is on full display with his 24th and 25th stolen bases of the season. His aggressive yet calculated approach on the basepaths, combined with his defensive skills (despite the two errors), shows why he's one of the most intriguing young talents to watch.",
            "start_time": 164.79
          },
          {
            "p": "Mickey Moniak and Brandon Drury showcase their power potential with back-to-back home runs. Drury's particularly impressive at-bat demonstrates his growth as a hitter, working the count before delivering the big hit. This kind of development in our players is exactly what makes player analysis so fascinating.",
            "start_time": 305.9
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "Yamamoto's pitch mechanics in the first inning demonstrate his elite adaptability. Watch how he adjusts his arm slot and release point after early command issues, particularly with his signature splitter. His ability to maintain consistent mechanics while varying pitch selection shows why he's one of baseball's most promising young talents.",
            "start_time": 24.12
          },
          {
            "p": "Shohei Ohtani's baserunning brilliance is on full display here. His first-step acceleration and elite sprint speed (measured at 29.8 ft/sec) turn a routine ground ball into a run-scoring play. Watch his perfect read of the defense and how he maintains optimal running angles - a masterclass in baserunning technique from one of baseball's most dynamic athletes.",
            "start_time": 126.08
          },
          {
            "p": "Gavin Lux's improvement against left-handed pitching is evident in this clutch double. Notice his refined bat path - keeping his hands inside and driving through the ball with improved hip rotation. His recent mechanical adjustments have resulted in a significant increase in opposite-field power, particularly against southpaws.",
            "start_time": 289.83
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "A fascinating strategic matchup between baseball's most storied franchises. The analytics tell an interesting story: the Dodgers' league-leading OPS+ against the Yankees' superior pitching WAR. Watch how both teams leverage their defensive positioning and pitch sequencing in high-leverage situations.",
            "start_time": 26.7
          },
          {
            "p": "The pitch selection data reveals compelling patterns - Yankees' staff heavily relies on elevated fastballs (42% usage above zone) while Dodgers counter with a diverse mix (no pitch type exceeding 30%). Watch how each team's approach evolves after the first time through the order, particularly with runners in scoring position.",
            "start_time": 89.32
          },
          {
            "p": "Base-running analytics become a critical factor - Dodgers' aggressive approach (+4.2 BsR) forces defensive adjustments, particularly with their optimal jump timing (1.3 seconds average). The Yankees counter by varying hold times and implementing a mix of slide-step deliveries, affecting their pitchers' effectiveness (-2.1% decrease in strike rate).",
            "start_time": 156.78
          },
          {
            "p": "Modern bullpen strategy on full display - high-leverage relievers deployed based on matchup data rather than traditional inning roles. The Dodgers' superior relief ERA (2.8) stems from optimal matchup exploitation and precise tunneling sequences, particularly evident in their right-handed relievers against left-handed power bats.",
            "start_time": 245.91
          }
        ]
      }
    },
    "alex-martinez": {
      "img": "assets/img/dodgers.jpg",
      "name": "Alex Martinez",
      "fan-type": "Casual Viewer",
      "description": "Background: General sports interest | Favourite Aspects: Exciting moments, highlights | Viewing Habits: Watches highlights, big games | Goals: Stay informed about major events",
      "favourite-aspect": "Exciting moments, highlights",
      "favorite-teams": "LA Dodgers",
      "favorite-players": "Freddie Freeman",
      "age": 44,
      "gender": "M",
      "location": "Los Angeles",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "Moderate",
      "minutes-watched-mlb-tv": "Low",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "Low",
      "season-ticket-holder": "Single Game Ticket Buyer",
      "family-with-kids": "Yes",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "<strong>Final Showdown</strong>: The tension is through the roof as Verdugo steps up to the plate! This is what sports entertainment is all about - bottom of the ninth, World Series on the line, and the crowd going absolutely wild. You can feel the electricity through the screen as the Yankees try to keep their hopes alive!",
            "start_time": 9.02
          },
          {
            "p": "<strong>Historic Comeback</strong>: Can you believe this comeback? The Dodgers were down 5-0 and somehow turned it around to win 7-6! This is the kind of dramatic turnaround that makes baseball so exciting for casual fans. The largest comeback in World Series clinching game history - talk about a game for the history books!",
            "start_time": 59.7
          },
          {
            "p": "<strong>Championship Celebration</strong>: Pure joy erupts at Yankee Stadium! The Dodgers players storm the field, the celebrations are wild, and the emotions are running high. This is exactly why we love sports - the raw excitement, the pure drama, and a finish that will be talked about for years to come!",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "<strong>Epic Showdown</strong>: The World Series we've all been waiting for! Baseball's biggest superstars - Ohtani, Judge, Freeman - all on the same stage. Two of the most legendary teams in baseball history going head-to-head for all the marbles. This is what October baseball is all about!",
            "start_time": 36.58
          },
          {
            "p": "<strong>Game-Changing Moment</strong>: Freeman crushes another one! That's FIVE straight World Series games with a home run - absolutely unbelievable! The crowd goes wild as Freddie continues his historic postseason run. You can't write scripts better than this!",
            "start_time": 99.44
          },
          {
            "p": "<strong>Hometown Hero</strong>: What a moment for New York's own Volpe! Bases loaded, pressure mounting, and BOOM - a grand slam that nearly blows the roof off Yankee Stadium! The rookie shortstop just wrote himself into Yankees playoff history!",
            "start_time": 394.19
          },
          {
            "p": "<strong>Championship Glory</strong>: The Dodgers complete the comeback of a lifetime! From down 5-0 to World Series champs - this is why baseball is the greatest show on earth! Ohtani gets his first ring, the Dodgers get their revenge, and we all got to witness an instant classic!",
            "start_time": 701.24
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "You couldn't ask for a better matchup - Dodgers vs Yankees in the World Series! The atmosphere is incredible with both teams' fans packing the stadiums. Even if you're not a die-hard fan, you can feel the excitement in the air. Perfect time to grab some friends and catch the action!",
            "start_time": 26.7
          },
          {
            "p": "The star power in this series is absolutely incredible! Ohtani, Judge, Betts, Soto - it's like an All-Star Game every night. Whether you're a baseball expert or just here for the fun, these guys put on an amazing show. The crowd goes wild every time one of them steps up to the plate!",
            "start_time": 96.14
          },
          {
            "p": "The ballpark experience is everything here - from the classic stadium vibes to the crowd doing the wave. Hot dogs, cold drinks, and playoff baseball - doesn't get much better than this! Love seeing all the fans decked out in team gear, creating that perfect October atmosphere.",
            "start_time": 199.08
          },
          {
            "p": "These games are pure entertainment - home runs, diving catches, close plays at the plate! It's the kind of series that reminds you why baseball's so much fun to watch with friends. Every game has those 'did you see that?' moments that get everyone talking!",
            "start_time": 324.70
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "The crowd is absolutely buzzing for Game 5! Nothing beats playoff baseball at Yankee Stadium - the place is packed and everyone's ready for an epic night. Perfect game to be at with friends, especially with both teams' aces on the mound. The energy is just incredible!",
            "start_time": 18.0
          },
          {
            "p": "Talk about getting your money's worth - Judge and Chisholm go back-to-back! The whole stadium erupts, everyone's high-fiving strangers, and the roar when those balls clear the fence is deafening. These are the moments you'll be talking about at work tomorrow!",
            "start_time": 31.76
          },
          {
            "p": "The game's got everything you could want - Cole dealing on the mound, great defensive plays, and the crowd going wild with every pitch. This is why you come to the ballpark! The playoff atmosphere is unreal - everyone's on their feet for every big moment.",
            "start_time": 159.58
          },
          {
            "p": "Edge of your seat stuff in the late innings! The tension in the crowd is electric - every pitch feels huge. Whether you're a baseball expert or just here for fun, you can't beat this kind of entertainment. These are the games that make baseball so awesome to watch with friends!",
            "start_time": 722.57
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "The crowd erupts as Cole and Devers face off in a dramatic showdown! The tension is electric as Cora storms out to defend his player - this is what baseball rivalries are all about!",
            "start_time": 27.24
          },
          {
            "p": "What a moment as Stanton rips that double down the line! The fans are on their feet as Chisholm races around to score the game's first run!",
            "start_time": 205.14
          },
          {
            "p": "The stadium is buzzing as Dominguez shows off his speed with that stolen base! The excitement builds with every pitch in this classic Yankees-Red Sox battle!",
            "start_time": 263.12
          },
          {
            "p": "The Bronx faithful explode as Gleyber's home run sails into the right field seats! Another unforgettable moment in this historic rivalry!",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Oh my goodness, you have to see this! Acuña absolutely crushes this ball - the sound off the bat is insane! The whole crowd just goes 'Whoa!' when it leaves his bat. These are the kind of highlights you immediately text to your friends!",
            "start_time": 4.3
          },
          {
            "p": "470 feet?! That's not just a home run, that's a moonshot! The ball lands in the Hank Aaron Terrace, and everyone in the stadium is just in awe. Even if you're not a big baseball fan, you can appreciate how ridiculous this blast is!",
            "start_time": 25.8
          },
          {
            "p": "Check out the replay - the way the outfielder doesn't even move because he knows it's gone, the dugout's reaction, and the fans going wild! This is the kind of highlight that makes baseball so fun to watch. Perfect clip to show at your next watch party!",
            "start_time": 42.5
          },
          {
            "p": "Love seeing the crowd's reaction as they realize just how far this ball went. Everyone's phones are out recording it, and you can hear the buzz in the stadium. These are the moments that make you glad you came to the game - what an absolute blast!",
            "start_time": 57.0
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "An exciting rivalry game with plenty of dramatic moments! From Betts' leadoff homer to Freeman's three-run blast and a game-tying home run. The back-and-forth action and close finish make this a must-watch. The historic rivalry adds extra weight to every play in this intense matchup.",
            "start_time": 4.3
          },
          {
            "p": "The crowd is electric from the first pitch! You can feel the intensity of this historic rivalry in every at-bat!",
            "start_time": 24.12
          },
          {
            "p": "What a moment as Mookie launches one into the bleachers! The fans are going absolutely wild!",
            "start_time": 56.38
          },
          {
            "p": "The tension builds as Yamamoto works his magic - every strikeout gets a bigger roar from the crowd!",
            "start_time": 155.02
          },
          {
            "p": "That double play brings everyone to their feet! The energy in the stadium is incredible!",
            "start_time": 289.83
          },
          {
            "p": "The fans are loving every minute as the bullpen shuts it down! Another classic chapter in this amazing rivalry!",
            "start_time": 437.55
          }
        ]
      }
    },
    "emily-davis": {
      "img": "assets/img/emily.jpg",
      "name": "Emily Davis",
      "fan-type": "Game Analyst",
      "description": "Background: Analytical mindset, often played baseball | Favourite Aspects: Strategy, game mechanics | Viewing Habits: Analyzes games, enjoys detailed commentary | Goals: Understand and appreciate game strategy",
      "favourite-aspect": "Strategy, game mechanics",
      "favorite-teams": null,
      "favorite-players": "Jacob deGrom, Max Fried",
      "age": 33,
      "gender": "F",
      "location": "Boston",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "High",
      "minutes-watched-mlb-tv": "High",
      "marital-status": "Single",
      "usd-spent-mlb-shop": "Low",
      "season-ticket-holder": "Half Season Ticket Member",
      "family-with-kids": "No",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "<strong>Defensive Strategy</strong>: Notice Roberts' precise defensive alignment for this final at-bat - outfielders positioned deeper than usual, accounting for Verdugo's 42% hard-hit rate in high-leverage situations. The infield shift slightly favors pull side while maintaining middle coverage, a data-driven decision based on Verdugo's spray charts in 2-strike counts.",
            "start_time": 10.36
          },
          {
            "p": "<strong>Pitch Sequencing</strong>: The methodical approach in this final at-bat demonstrates elite game-calling. After establishing the fastball early, they work the corners systematically, utilizing the expanded strike zone that's been consistent throughout the game. The 1-2 count creates optimal leverage for their out-pitch strategy.",
            "start_time": 19.94
          },
          {
            "p": "<strong>Managerial Analytics</strong>: Dave Roberts' decision to use Buehler on two days' rest showcases modern analytics application. The data supported this unconventional move - Buehler's fastball velocity and spin rate maintained consistency despite short rest, validating the high-leverage relief appearance that secured this historic comeback.",
            "start_time": 59.7
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "<strong>Strategic Matchups</strong>: Fascinating bullpen deployment by Roberts in Game 1. Using Buehler on short rest shows advanced understanding of recovery metrics - his velocity and spin rate data supported this high-leverage decision. The analytics validated this unconventional move that proved crucial for the series.",
            "start_time": 162.98
          },
          {
            "p": "<strong>Pitch Sequencing</strong>: Yamamoto's Game 2 mastery exemplifies elite game-calling. His pitch mix kept hitters off-balance - establishing fastball early, then leveraging his splitter's similar tunnel but 8-10 mph velocity differential. Yankees' chase rate increased 15% on off-speed pitches after the fourth inning.",
            "start_time": 238.44
          },
          {
            "p": "<strong>Defensive Positioning</strong>: Notice the Dodgers' outfield alignment adjustments in Game 3 - playing deeper against right-handed pull hitters, accounting for the Stadium's short porch. Their spray chart analysis paid off with Hernández's perfect positioning for that game-saving throw to home.",
            "start_time": 326.23
          },
          {
            "p": "<strong>Game Theory</strong>: The 5-0 comeback showcases modern win probability dynamics. Each Dodgers scoring opportunity was maximized through optimal base-running aggression - their success rate on extra bases taken (67%) far exceeded league average (51%). Strategic pitch selection in high-leverage spots proved decisive.",
            "start_time": 701.24
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "This matchup presents fascinating strategic contrasts in offensive philosophy - Yankees' power-centric approach (MLB-leading .483 SLG) versus Dodgers' contact-focused strategy (82.3% contact rate, lowest K%). The defensive alignments evolve throughout the series, with both teams adjusting their shifts based on spray chart tendencies and count leverage.",
            "start_time": 26.7
          },
          {
            "p": "The pitch selection data reveals compelling patterns - Yankees' staff heavily relies on elevated fastballs (42% usage above zone) while Dodgers counter with a diverse mix (no pitch type exceeding 30%). Watch how each team's approach evolves after the first time through the order, particularly with runners in scoring position.",
            "start_time": 89.32
          },
          {
            "p": "Base-running analytics become a critical factor - Dodgers' aggressive approach (+4.2 BsR) forces defensive adjustments, particularly with their optimal jump timing (1.3 seconds average). The Yankees counter by varying hold times and implementing a mix of slide-step deliveries, affecting their pitchers' effectiveness (-2.1% decrease in strike rate).",
            "start_time": 156.78
          },
          {
            "p": "Modern bullpen strategy on full display - high-leverage relievers deployed based on matchup data rather than traditional inning roles. The Dodgers' superior relief ERA (2.8) stems from optimal matchup exploitation and precise tunneling sequences, particularly evident in their right-handed relievers against left-handed power bats.",
            "start_time": 245.91
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "Cole's approach in the early innings is methodical - establishing his four-seam fastball (96.8 mph average) up in the zone while maintaining an optimal release point variance of just 0.8 inches. His pitch tunneling metrics (2.3 inches of separation at decision point) create deception between his fastball and slider.",
            "start_time": 18.0
          },
          {
            "p": "The game pivots on the Dodgers' third-inning adjustments - they increase their first-pitch swing rate against Cole from 27% to 44%, disrupting his typical sequencing patterns. Their average launch angle against his fastball rises from 12° to 18°, indicating a deliberate approach to counter his high-zone strategy.",
            "start_time": 159.58
          },
          {
            "p": "Roberts' bullpen deployment shows masterful leverage recognition - bringing in Miller (2.1 FIP vs LHH) to face the Yankees' left-handed power core in the sixth, then transitioning to Phillips whose sinker-slider combo generates a 63% ground ball rate against right-handed batters.",
            "start_time": 326.23
          },
          {
            "p": "Defensive positioning becomes crucial in late innings - the Dodgers' outfield alignment adjusts -12 feet deeper with Chapman at bat, respecting his 92.3 mph average exit velocity. The infield positioning with runners on base reflects detailed spray chart analysis, particularly evident in the critical 8th inning double play.",
            "start_time": 481.71
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "<strong>Base-Running Efficiency</strong>: Acuña's elite jump metrics on display - 0.3 second reaction time from first movement to full acceleration. Note his optimal lead distance (12.5 feet) and perfect angle tracking to second base, resulting in a 3.1 second baseline-to-baseline time that neutralizes even above-average pop times.",
            "start_time": 9.02
          },
          {
            "p": "<strong>Pitch Recognition</strong>: Watch his immediate recognition of the slider's spin axis (2300 RPM) and location (middle-away). Acuña's ability to maintain his hitting mechanics while identifying off-speed pitches early leads to consistent hard contact - evidenced by his 92.5 mph exit velocity on this swing.",
            "start_time": 65.54
          },
          {
            "p": "<strong>Situational Awareness</strong>: Exemplary secondary lead technique when breaking for second. His pre-pitch setup (6.8 foot primary, 12.5 foot secondary) forces the defense to respect both his speed and ability to get back to first, creating a strategic advantage in steal situations.",
            "start_time": 115.32
          },
          {
            "p": "<strong>Power Mechanics</strong>: Perfect demonstration of his power generation sequence. Hip-shoulder separation peaks at 62 degrees, launch angle optimized at 27 degrees, and barrel speed reaching 76 mph through the zone. These mechanics consistently produce exit velocities in the 95th percentile.",
            "start_time": 186.76
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "Fascinating strategic dynamics in the Cole-Devers matchup. The intentional walk after the HBP incident shows a 15.3% increase in run expectancy, but Cora's reaction suggests deeper game theory implications.",
            "start_time": 27.24
          },
          {
            "p": "Rodon's pitch selection shows significant optimization - 96mph fastballs at the top of the zone yielding a 35% whiff rate, while his breaking balls generate 65% ground ball contact.",
            "start_time": 146.04
          },
          {
            "p": "Stanton's RBI double registered 108.5 mph exit velocity at a 25-degree launch angle - nearly optimal for extra-base hit probability in Yankee Stadium's dimensions.",
            "start_time": 205.14
          },
          {
            "p": "Gleyber's opposite-field home run demonstrates the benefits of the adjusted launch angle approach - 29 degrees with backspin creating optimal carry in the afternoon conditions.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "The Mariners' offensive approach against Aldegary showed textbook exploitation of a rookie pitcher's tendencies. They forced him into high-stress situations by extending at-bats (4.2 pitches per PA in the first inning) and capitalizing on his elevated release point when he worked from the stretch.",
            "start_time": 67.2
          },
          {
            "p": "Fascinating pitch sequencing from George Kirby, especially after the Ward home run. Notice how he adjusted his approach, increasing his breaking ball usage from 23% to 35% in subsequent innings, effectively keeping hitters off balance. His command metrics remained elite with a 68% first-pitch strike rate.",
            "start_time": 141.61
          },
          {
            "p": "Key defensive positioning shifts by Seattle's outfield throughout the game: Robles playing 15 feet shallower than league average against bottom-third hitters, while maintaining plus-15 feet depth against Ward and Moniak. This directly impacted two crucial plays in the 6th inning.",
            "start_time": 305.9
          },
          {
            "p": "Critical bullpen management by both teams in high-leverage situations. Seattle's decision to bring in Shaquan with runners on base deviated from their normal usage patterns, but the matchup metrics supported this move - he had a 68% ground ball rate against left-handed hitters in similar situations.",
            "start_time": 428.48
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "Yamamoto's first-inning approach shows calculated risk-taking - his splitter usage increases to 38% (up from season average 29%), exploiting the Giants' .198 wOBA against the pitch. His release point consistency (0.4 inch variance) creates effective pitch tunneling, particularly with the four-seam combo.",
            "start_time": 24.12
          },
          {
            "p": "The Giants' defensive strategy backfires against Betts - their +7 foot deeper outfield positioning, based on his 89.4 mph average exit velocity, proves insufficient against his optimized launch angle (27°). His first-pitch swing rate (42%) forces Webb to adjust his typical setup patterns.",
            "start_time": 155.02
          },
          {
            "p": "Fascinating middle-inning chess match - the Dodgers' bullpen deployment shows precise leverage index optimization (2.87 gmLI for high-stress situations). Phillips' appearance against the heart of the order yields a 68% whiff rate on breaking balls, well above his season average.",
            "start_time": 289.83
          },
          {
            "p": "Late-game defensive efficiency peaks with the Dodgers' 92.3% double play conversion rate (league average: 71%). Their infield positioning with runners on shows advanced spray chart implementation, creating -3.2 runs prevented through optimal alignment.",
            "start_time": 437.55
          }
        ]
      }
    },
    "chris-lee": {
      "img": "assets/img/braves.jpg",
      "name": "Chris Lee",
      "fan-type": "Big Event Fan",
      "description": "Background: Enjoys spectacle and drama | Favourite Aspects: High-stakes games, records | Viewing Habits: Watches playoffs, All-Star games | Goals: Experience excitement of major events",
      "favourite-aspect": "High-stakes games, records",
      "favorite-teams": "Atlanta Braves",
      "favorite-players": "Ronald Acuña Jr.",
      "age": 19,
      "gender": "M",
      "location": "Chicago",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "Moderate",
      "minutes-watched-mlb-tv": "Low",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "Medium",
      "season-ticket-holder": "Single Game Ticket Buyer",
      "family-with-kids": "No",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "<strong>Championship Moment</strong>: This is what October baseball is all about! The tension reaches its peak as Verdugo steps up to the plate with everything on the line. The crowd is on their feet, holding their breath with every pitch - you can't script drama better than this!",
            "start_time": 9.02
          },
          {
            "p": "<strong>Victory Celebration</strong>: The ultimate baseball celebration unfolds at Yankee Stadium! The raw emotion, the team storming the field, the pure elation of winning baseball's ultimate prize - this is what makes the World Series the greatest show in sports!",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "<strong>October Magic</strong>: Volpe delivers the moment of a lifetime! A grand slam in the World Series at Yankee Stadium - the rookie shortstop living every kid's dream! The stadium is absolutely erupting as the Yankees fight to stay alive in this incredible series!",
            "start_time": 394.19
          },
          {
            "p": "<strong>Championship Comeback</strong>: The Dodgers complete one of the greatest comebacks in World Series history! From down 5-0 to champions, they've written another incredible chapter in this legendary rivalry! Ohtani gets his ring, the Dodgers get their revenge, and we all got to witness an instant classic!",
            "start_time": 701.24
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "Baseball's dream matchup is finally here! The legendary Dodgers-Yankees rivalry writes its newest chapter as these iconic franchises clash for the first time in the Fall Classic since 1981! Two teams with 35 combined World Series titles - this is what October dreams are made of!",
            "start_time": 26.7
          },
          {
            "p": "The star power in this series is absolutely incredible! Ohtani, Judge, Betts, Soto - some of the biggest names in baseball colliding on its grandest stage! The electricity as these superstars face off in baseball's most historic ballparks will give you goosebumps!",
            "start_time": 96.14
          },
          {
            "p": "Every pitching matchup is must-see TV! Cole vs. Yamamoto, Glasnow vs. Rodon - these are the kind of legendary duels that define World Series history! The tension builds with every pitch as these aces battle for baseball immortality!",
            "start_time": 199.08
          },
          {
            "p": "The drama of this series is off the charts! From extra-inning thrillers to late-game heroics, we're watching an instant classic unfold! These moments will be replayed for generations as two of baseball's most storied franchises battle for ultimate glory!",
            "start_time": 324.70
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "The stage is set for an epic Game 5 showdown at Yankee Stadium! The electricity in the air is palpable as these two legendary franchises battle for baseball's ultimate prize! With the Dodgers one win away from glory, we're about to witness history in the making!",
            "start_time": 18.0
          },
          {
            "p": "What drama as the Yankees strike first! Judge's mammoth blast into Monument Park gives them an early 5-0 lead, and the Bronx is absolutely rocking! But remember - no lead is safe in October, especially with these resilient Dodgers!",
            "start_time": 156.32
          },
          {
            "p": "The comeback for the ages begins! Ohtani and Betts spark an incredible rally, chipping away at the lead! Every at-bat feels like a heavyweight punch as these titans trade blows in one of the most dramatic World Series games ever!",
            "start_time": 287.91
          },
          {
            "p": "Hold onto your seats - we're watching an instant classic! The Dodgers have stormed all the way back to take the lead! The tension is unbearable as Buehler comes in to try and close it out - this is the stuff baseball legends are made of!",
            "start_time": 445.23
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "<strong>Speed Demon</strong>: Incredible! Acuña makes it 20 for 20 in stolen bases against the Mets this season - a perfect record! The crowd erupts as he blazes around the bases, showing why he's the most electrifying player in baseball. This kind of dominance against one team is the stuff of legends!",
            "start_time": 9.02
          },
          {
            "p": "<strong>Record Chase</strong>: Another stolen base for the history books! Acuña's combination of power and speed is putting him on pace for one of the greatest seasons we've ever seen. The energy in the stadium builds every time he reaches base - everyone knows they're witnessing something special!",
            "start_time": 65.54
          },
          {
            "p": "<strong>Clutch Performance</strong>: The anticipation builds as Acuña takes his lead - and THERE HE GOES! The fans are on their feet as he swipes yet another bag, adding to his incredible stats. This is the kind of electric baseball that brings people to the ballpark!",
            "start_time": 115.32
          },
          {
            "p": "<strong>Monster Shot</strong>: ABSOLUTELY CRUSHED! Acuña launches one into orbit - 461 feet of pure power! The crowd goes wild as he admires this mammoth blast, his first homer of 2024! After his historic 40-40 season last year, he's picking up right where he left off with another spectacular show of power!",
            "start_time": 186.76
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Witness an absolutely jaw-dropping display of raw power as Ronald Acuña Jr. launches a mammoth 470-foot home run that lands in the historic Hank Aaron Terrace! This is the kind of spectacular moment that baseball fans live for!",
            "start_time": 4.3
          },
          {
            "p": "In a crucial 3-1 count, Acuña demonstrates why he's one of baseball's most electrifying players, absolutely demolishing a high sinker for one of the longest home runs of the season. The sound off the bat and the immediate reaction tell you this is something special!",
            "start_time": 8.34
          },
          {
            "p": "The ball's trajectory into the Hank Aaron Terrace adds a layer of historical significance to this monster blast. When you're hitting balls to places named after baseball legends, you know you're witnessing something extraordinary!",
            "start_time": 15.5
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ]
      }
    },
    "charles-harris": {
      "img": "assets/img/yankees.jpg",
      "name": "Charles Harris",
      "fan-type": "Nostalgic Fan",
      "description": "Background: Grew up watching baseball's golden era | Favourite Aspects: Classic games, legendary players | Viewing Habits: Watches classic games, documentaries | Goals: Relive golden moments of baseball history",
      "favourite-aspect": "Classic games, legendary players",
      "favorite-teams": "NY Yankees",
      "favorite-players": "Aaron Judge, Gerrit Cole",
      "age": 58,
      "gender": "M",
      "location": "New York",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "Moderate",
      "minutes-watched-mlb-tv": "Moderate",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "Medium",
      "season-ticket-holder": "Half Season Ticket Member",
      "family-with-kids": "Yes",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "<strong>Classic Rivalry</strong>: The ghosts of baseball past echo through Yankee Stadium as this storied rivalry writes its newest chapter. Just like the Brooklyn days, a Dodgers-Yankees World Series brings out the purest essence of baseball tradition. Verdugo carries the weight of pinstripe history as he steps to the plate.",
            "start_time": 9.02
          },
          {
            "p": "<strong>Historic Turnaround</strong>: In all my years watching baseball, this comeback ranks among the most memorable. From the Subway Series of the '50s to today, the Dodgers-Yankees rivalry continues to produce unforgettable moments. This 5-0 collapse will be remembered alongside the classic games of yesteryear.",
            "start_time": 59.7
          },
          {
            "p": "<strong>Baseball Tradition</strong>: The sight of celebration in the Cathedral of Baseball brings back memories of past World Series classics. While the outcome stings, it adds another chapter to baseball's greatest rivalry - a story that began in Brooklyn and continues to captivate generations of fans.",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "<strong>Timeless Rivalry</strong>: The 12th meeting between these storied franchises brings back memories of the Subway Series days. Just like when Jackie Robinson faced Whitey Ford, the Yankees-Dodgers rivalry still captures baseball's purest essence. From Brooklyn to LA, some things never change.",
            "start_time": 36.58
          },
          {
            "p": "<strong>Classic Ballpark</strong>: There's something magical about October baseball in Yankee Stadium. The shadows stretching across the infield remind me of those golden afternoon games of the '50s and '60s. The ghosts of DiMaggio and Mantle still roam these grounds.",
            "start_time": 99.44
          },
          {
            "p": "<strong>Baseball Heritage</strong>: Watching Volpe's grand slam brings back memories of Bucky Dent's heroics in '78. A New York kid living out his dreams in pinstripes - some stories are simply timeless. The Stadium shaking just like it did in the days of Reggie and Thurman.",
            "start_time": 394.19
          },
          {
            "p": "<strong>Eternal Game</strong>: This series had everything that makes baseball timeless - clutch hitting, strategic pitching changes, dramatic comebacks. From the Dodgers' origins in Brooklyn to today's modern classic, baseball's greatest rivalry adds another chapter to its storied history.",
            "start_time": 701.24
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "The Fall Classic returns to the Cathedral of Baseball for Game 3. These shadows stretching across the infield remind me of the golden age - when the Brooklyn Dodgers would make that fateful trip up to the Bronx to face our beloved Bombers. The electricity in the air hasn't changed since those classic matchups of the '50s.",
            "start_time": 26.7
          },
          {
            "p": "Freeman's home run stings, but it reminds me of how Duke Snider used to torment us in those old Subway Series. Though the names and faces change, the intensity of this Yankees-Dodgers rivalry remains just as fierce as it was when Yogi Berra was behind the plate and Jackie Robinson was stealing bases.",
            "start_time": 96.14
          },
          {
            "p": "Watching Judge step in against Buehler brings back memories of those epic at-bats between Mickey Mantle and Don Newcombe. The Stadium may be new, but that familiar October chill in the Bronx air takes me right back to when this matchup was an annual autumn ritual between baseball's greatest franchises.",
            "start_time": 199.08
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "The electricity in the Bronx tonight reminds me of those classic Game 5s of the past - Bob Turley in '56, Ron Guidry in '77. Our ace Gerrit Cole takes the mound carrying the weight of Yankees history on his shoulders, just like the greats before him. The Stadium's alive with that familiar October magic.",
            "start_time": 0.0
          },
          {
            "p": "Aaron Judge's blast to right-center - pure Yankees power baseball! It brings back memories of Reggie Jackson in '77, the way the crowd erupted, the majesty of the moment. When Judge connects like that, he channels the spirit of those mighty Yankees sluggers of the past - Ruth, Gehrig, Mantle, all of them.",
            "start_time": 91.32
          },
          {
            "p": "Every pitch in this elimination game carries the weight of our 27 championships. Cole's determination on the mound reminds me of Whitey Ford in those pressure-packed games against the Dodgers. The pinstripes still represent excellence, just as they did when I first fell in love with this team decades ago.",
            "start_time": 272.52
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "The Cole-Devers confrontation recalls the fierce pitcher-batter rivalries of baseball's past, reminiscent of Gibson vs. Aaron or Clemens vs. Piazza. These moments define the Yankees-Red Sox legacy.",
            "start_time": 27.24
          },
          {
            "p": "Rodon's dominant pitching performance brings to mind the great Yankees-Red Sox duels of the past, where aces like Pedro Martinez and Roger Clemens would battle for supremacy.",
            "start_time": 146.04
          },
          {
            "p": "Stanton's clutch hitting continues the tradition of Yankees sluggers coming through in big moments against Boston, following in the footsteps of Mantle, Jackson, and O'Neill.",
            "start_time": 205.14
          },
          {
            "p": "Gleyber's opposite-field power shows how modern players are adapting to the historic dimensions of Yankee Stadium, just as lefty sluggers of the past took advantage of the short porch.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "A continuation of the historic Dodgers-Giants rivalry that dates back to their New York days. While the players have changed, the intensity of this classic West Coast rivalry remains as strong as ever.",
            "start_time": 4.3
          },
          {
            "p": "This rivalry adds another classic chapter - the 2,548th meeting between these storied franchises dates back to their New York roots.",
            "start_time": 24.12
          },
          {
            "p": "Yamamoto's performance reminiscent of Orel Hershiser's dominance against the Giants in the late 80s - same devastating splitter approach.",
            "start_time": 155.02
          },
          {
            "p": "The Lux-Smith double play combo showing shades of the Lopes-Russell partnership that anchored the infield in the 70s.",
            "start_time": 289.83
          },
          {
            "p": "This bullpen performance ranks among the best in the rivalry's history - echoes of the dominant relief corps from the 1965 pennant race.",
            "start_time": 437.55
          },
          {
            "p": "The defensive shifts and analytics-driven positioning show how far this rivalry has evolved from the pure gut-instinct days of Leo Durocher.",
            "start_time": 520.79
          }
        ]
      }
    }
  },

  "fan-schema": [
    {
      "Fan Type": "Die-hard Team Loyalist",
      "description": "Most engaged fan segment with highest game attendance and digital  viewership. Consistently high merchandise spending and likely to hold season tickets. Extremely active in team-related content consumption."
    },
    {
      "Fan Type": "Player Enthusiast",
      "description": "Moderate overall engagement focused on specific players. Shows high engagement with player-specific content and merchandise. Regular viewer of games featuring favorite players."
    },
    {
      "Fan Type": "Casual Viewer",
      "description": "Lower regular engagement but spikes during major events. Occasional game attendance and moderate highlights consumption. Limited merchandise purchases focused on popular items."
    },
    {
      "Fan Type": "Game Analyst",
      "description": "High engagement with statistical content and detailed game analysis. Strong digital  usage focused on specific game situations. Moderate merchandise spending on technical gear."
    },
    {
      "Fan Type": "Big Event Fan",
      "description": "Concentrated engagement during playoffs and special events. High viewership of marquee games and significant event-related merchandise purchases. Limited regular season engagement."
    },
    {
      "Fan Type": "Nostalgic Fan",
      "description": "Strong engagement with historical content and classic game replays. Regular viewer of documentaries and legacy content. High collector's item purchases from team shops."
    }
  ],
  "prompts": {
    "interests": "Given this information about a financial advisor, return a JSON object {\"interests\": \"...\"} containing comma-separated keywords they would be interested in when listening to a financial podcast.",
    "highlights": "Given this video transcript:\n\nTitle: ${title}\n${transcript_with_timing}\n\nWrite a few paragraphs for:\n\n${profile}\n\nExplain the implications for their investors and how they can leverage this information to maximize returns for their clients. Respond as JSON paragraphs with timing.\n\n```json\n[\n{\"p\": \"[firstname], this video can help your [clientele] about ...\",\"start_time\": ...},{\"p\": \"[insight 1]\",\"start_time\": ...},{\"p\": \"[insight 2]\",\"start_time\": ...},{\"p\": \"[insight 3]\",\"start_time\": ...},]"
  }
}
