{
  "videos": {
    "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": {
      "source": "mlb",
      "title": "FINAL OUT: The Dodgers win the 2024 World Series!",
      "url": "https://www.mlb.com/video/final-out-dodgers-win-2024-world-series",
      "video": "https://www.mlb.com/video/final-out-dodgers-win-2024-world-series",
      "youtube": "5dGZffKDYr4",
      "transcript": "videos/FINAL_OUT_The_Dodgers_win_the_2024_World_Series.json"
    },
    "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": {
      "source": "mlb",
      "title": "World Series Cinematic Recap: Dodgers take home title in epic 5 games vs. Yankees",
      "url": "https://www.mlb.com/video/dodgers-take-home-title-in-epic-5-games-vs-yankees",
      "video": "https://www.mlb.com/video/dodgers-take-home-title-in-epic-5-games-vs-yankees",
      "youtube": "1hzr56sIIBI",
      "transcript": "videos/Dodgers_take_home_title_in_epic_5_games_vs_Yankees.json"
    },
    "Dodgers_vs_Yankees_World_Series": {
      "source": "mlb",
      "title": "Dodgers vs Yankees World Series",
      "url": "https://www.mlb.com/video/dodgers-vs-yankees-world-series",
      "video": "https://www.mlb.com/video/dodgers-vs-yankees-world-series",
      "youtube": "4wvPYubV6cg",
      "transcript": "videos/Dodgers_vs_Yankees_World_Series.json"
    },
    "Dodgers_vs_Yankees_World_Series_Game_5": {
      "source": "mlb",
      "title": "Dodgers vs Yankees World Series Game 5",
      "url": "https://www.mlb.com/video/dodgers-vs-yankees-world-series-game-5",
      "video": "https://www.mlb.com/video/dodgers-vs-yankees-world-series-game-5",
      "youtube": "j3ykZoQMJLI",
      "transcript": "videos/Dodgers_vs_Yankees_World_Series_Game_5.json"
    },
    "Ronald_Acuña_Jr": {
      "source": "mlb",
      "title": "Ronald Acuña Jr. Highlights",
      "url": "https://www.mlb.com/video/ronald-acuna-jr-highlights",
      "video": "https://www.mlb.com/video/ronald-acuna-jr-highlights",
      "youtube": "K5ZSoLLwZ9c",
      "transcript": "videos/Ronald_Acuña_Jr.json"
    },
    "Red_Sox_vs_Yankees": {
      "source": "mlb",
      "title": "Red Sox vs Yankees",
      "url": "https://www.mlb.com/video/red-sox-vs-yankees",
      "video": "https://www.mlb.com/video/red-sox-vs-yankees",
      "youtube": "re3XQhF1CeQ",
      "transcript": "videos/Red_Sox_vs_Yankees_Game.json"
    },
    "Mariners_vs_Angels": {
      "source": "mlb",
      "title": "Mariners vs Angels",
      "url": "https://www.mlb.com/video/mariners-vs-angels",
      "video": "https://www.mlb.com/video/mariners-vs-angels",
      "youtube": "IVJg2l5JWRI",
      "transcript": "videos/Mariners_vs_Angels.json"
    },
    "Dodgers_vs_Giants_Highlights": {
      "source": "mlb",
      "title": "Dodgers vs Giants Highlights",
      "url": "https://www.mlb.com/video/dodgers-vs-giants-highlights",
      "video": "https://www.mlb.com/video/dodgers-vs-giants-highlights",
      "youtube": "WS0RGpeZK9w",
      "transcript": "videos/Dodgers_vs_Giants_Highlights.json"
    },
    "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": {
      "source": "mlb",
      "title": "470 FEET Ronald Acuña Jr. ABSOLUTELY DEMOLISHED this baseball",
      "url": "https://www.mlb.com/video/470-feet-ronald-acu%C3%B1a-jr-absolutely-demolished-this-baseball",
      "video": "https://www.mlb.com/video/470-feet-ronald-acu%C3%B1a-jr-absolutely-demolished-this-baseball",
      "youtube": "4jeT8nEpWNE",
      "transcript": "videos/470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball.json"
    }
  },
  "advisors": {
    "kevin-edwards": {
      "img": "img/yankees-family.jpg",
      "name": "Kevin Edwards",
      "fan-type": "Die-hard Team Loyalist",
      "description": "Background: Lifelong fan, often local | Favourite Aspects: Team history, rivalries | Viewing Habits: Watches every game, attends live | Goals: Support team through thick and thin",
      "favourite-aspect": "Team history, rivalries",
      "favorite-teams": "NY Yankees",
      "favorite-players": "Aaron Judge, Gerrit Cole",
      "age": 45,
      "gender": "M",
      "location": "New York",
      "games-attended-2024": "High",
      "games-watched-mlb-tv": "High",
      "minutes-watched-mlb-tv": "High",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "High",
      "season-ticket-holder": "Half Season Ticket Member",
      "family-with-kids": "Yes",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "A heartbreaking moment as Verdugo represents our last hope. The Yankees' dream of a 28th championship slips away as we watch a 5-0 lead evaporate in this historic collapse.",
            "start_time": 9.02
          },
          {
            "p": "The largest comeback in World Series clinching game history comes against us. A bitter pill to swallow as our rivals from LA claim their eighth title.",
            "start_time": 59.7
          },
          {
            "p": "The pain of watching the Dodgers celebrate on our home field - a 7-6 defeat that will haunt the Bronx for years to come. A reminder of how cruel October baseball can be.",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "The journey to our 28th championship began with such promise - Juan Soto's electrifying three-run blast sending us to another World Series! As a Yankees fan who's lived through the glory years, seeing us back in the Fall Classic felt like destiny. Our 12th meeting with the Dodgers brought back memories of those classic battles that defined baseball history.",
            "start_time": 36.58
          },
          {
            "p": "Every Yankees fan knows our storied past with the Dodgers - from our dominance in the 40s and 50s to the sweet revenge in '77 and the heartbreak of '81. Each game of this series carried that weight of history, that expectation that comes with wearing the pinstripes. The ghosts of Yankees past seemed to be watching from Monument Park.",
            "start_time": 133.94
          },
          {
            "p": "Our boys fought with that legendary Yankees heart - Judge's towering homers, Cole's gutsy performances, the Stadium shaking with each rally. Even in defeat, they showed why we're the most decorated franchise in sports. The pain of coming up short burns deep, but true Yankees fans know we'll be back - we always come back.",
            "start_time": 326.23
          },
          {
            "p": "As the celebration shifts to LA, we hold our heads high. 27 championships tell the story of who we are. This hurts now, but being a Yankees fan means believing in the legacy, the tradition, the inevitability of our return to glory. In the Bronx, we don't rebuild - we reload. Number 28 will come, and when it does, it'll be even sweeter.",
            "start_time": 481.71
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "Our rivalry with the Dodgers is the stuff of baseball legend - from the Subway Series of the 40s and 50s to our epic battles in '77 and '81. This matchup brings back memories of legendary Yankees moments. Now it's our turn to add another chapter to this historic rivalry.",
            "start_time": 26.7
          },
          {
            "p": "Every pitch, every at-bat carries the weight of our storied rivalry with the Dodgers. From the subway series of the 40s and 50s to our epic battles in '77 and '81, this matchup brings back memories of legendary Yankees moments. Now it's our turn to add another chapter to this historic rivalry.",
            "start_time": 96.14
          },
          {
            "p": "The Stadium is packed with the most passionate fans in baseball, creating that signature October atmosphere that's uniquely Yankees. You can feel the presence of our 27 championships, with Monument Park standing as a reminder of the legends who've worn the pinstripes in games just like this.",
            "start_time": 199.08
          },
          {
            "p": "This series isn't just about winning - it's about upholding the legacy of Ruth, Gehrig, DiMaggio, and Mantle. Every Yankees fan knows that anything less than a championship isn't enough. We're here to bring home number 28, adding another golden chapter to baseball's most illustrious franchise.",
            "start_time": 324.70
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "Our ace Gerrit Cole takes the mound in the biggest game of the year, with the weight of Yankee history on his shoulders. The electricity in Yankee Stadium is palpable as we fight to keep our championship hopes alive. This is what being a Yankees fan is all about - the pressure, the history, the chance for greatness.",
            "start_time": 18.0
          },
          {
            "p": "Judge and Chisholm Jr. send the Bronx into a frenzy with back-to-back bombs! The Stadium is shaking as we take an early 3-0 lead. This is Yankees baseball at its finest - power hitting in October, just like the days of Ruth and Gehrig, Mantle and Maris.",
            "start_time": 31.76
          },
          {
            "p": "Cole is dealing like a true Yankees ace, painting the corners and showing why he's the heir to our incredible pitching legacy. Every strikeout brings back memories of Whitey Ford in the '50s and Ron Guidry in '78. This is the kind of performance that adds to the Yankees' championship mystique.",
            "start_time": 159.58
          },
          {
            "p": "The tension mounts as we try to protect our lead in the late innings. Every pitch, every play carries the weight of 27 championships behind it. The ghosts of Yankees past seem to be watching as we battle to force a Game 6 and keep the dream of number 28 alive.",
            "start_time": 722.57
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "Intense rivalry moment as Cole faces Devers - the kind of matchup that defines Yankees baseball. The tension builds as Cora accuses Cole of intentionally hitting Devers, adding another chapter to our storied rivalry.",
            "start_time": 27.24
          },
          {
            "p": "Rodon shows his dominance with a masterful pitching performance, striking out batters with a devastating mix of 96mph fastballs and sharp breaking balls. This is the kind of pitching depth we need for October.",
            "start_time": 146.04
          },
          {
            "p": "Stanton comes through with a clutch RBI double, showing why he's such a key part of our lineup. The way he drove that ball into the corner is exactly what we expect from our power hitters.",
            "start_time": 205.14
          },
          {
            "p": "Gleyber stays hot with that opposite-field home run to make it 2-0! The way he's been hitting lately shows how our offense can manufacture runs even in tight games.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ]
      }
    },
    "sarah-johnson": {
      "img": "img/angels.jpg",
      "name": "Sarah Johnson",
      "fan-type": "Player Enthusiast",
      "description": "Background: Follows player careers | Favourite Aspects: Player stats, achievements | Viewing Habits: Watches games featuring favorite players | Goals: See favorite players succeed and break records",
      "favourite-aspect": "Player stats, achievements",
      "favorite-teams": "LA Angels",
      "favorite-players": "Shohei Ohtani, Mike Trout",
      "age": 32,
      "gender": "F",
      "location": "Los Angeles",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "High",
      "minutes-watched-mlb-tv": "Moderate",
      "marital-status": "Single",
      "usd-spent-mlb-shop": "Medium",
      "season-ticket-holder": "Quarter Season Ticket Member",
      "family-with-kids": "No",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "The final sequence to Verdugo - notice how they played the percentages, working the corners, changing eye levels, before getting the crucial final out.",
            "start_time": 9.02
          },
          {
            "p": "Watch Walker Buehler's mechanics here - coming in on just two days rest, his delivery remains remarkably consistent. The fastball command and sharp breaking stuff show no signs of fatigue.",
            "start_time": 59.7
          },

          {
            "p": "Dave Roberts' bullpen management masterclass - the strategic timing of bringing in Buehler, the matchup plays throughout the comeback, every move calculated perfectly.",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [

          {
            "p": "Shohei Ohtani's plate discipline is evident in his leadoff walk against Schmidt, demonstrating his elite pitch recognition. His aggressive baserunning mechanics follow, showing perfect form as he takes an optimal secondary lead, ready to capitalize on any opportunity to advance.",
            "start_time": 36.58
          },
          {
            "p": "Watch Freddie Freeman's swing mechanics on his fifth consecutive World Series home run - the perfect combination of hip rotation, bat speed, and launch angle. His ability to consistently barrel up pitches while maintaining his timing through a long series shows his elite-level preparation and adaptability.",
            "start_time": 99.44
          },
          {
            "p": "Walker Buehler's return from Tommy John surgery showcases remarkable mechanical consistency. His delivery remains efficient and repeatable, particularly evident in his back-to-back strikeouts. Notice how he maintains his arm slot and release point even after the long recovery process.",
            "start_time": 191.50
          },
          {
            "p": "Kiké Hernández's outfield assist demonstrates perfect throwing mechanics - watch his footwork, quick transfer, and arm slot as he delivers a pinpoint throw to nail the runner. His ability to maintain accuracy while generating maximum velocity from left field is a masterclass in defensive execution.",
            "start_time": 326.23
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "A masterclass in power hitting opens Game 5 as Aaron Judge demonstrates perfect timing and mechanics on a first-pitch fastball, launching it to right-center. Jazz Chisholm follows with his own display of hitting prowess, showing how different batting styles can produce similar results.",
            "start_time": 24.12
          },
          {
            "p": "Watch Gerrit Cole's pitch sequencing and command as he carries a no-hitter deep into the game! The tension builds with every out, and Judge adds to the excitement with an incredible leaping catch at the wall that brings the crowd to their feet!",
            "start_time": 45.3
          },
          {
            "p": "The game showcases contrasting approaches at the plate: Volpe's aggressive first-pitch hitting versus Freeman's patient at-bats. Each player's unique style and adjustments throughout the game provide fascinating insight into high-level hitting approaches.",
            "start_time": 67.2
          },
          {
            "p": "A study in clutch performance as both Stanton and Freeman deliver in high-pressure situations. Stanton's opposite-field power and Freeman's ability to hit with runners in scoring position demonstrate why they're among baseball's elite hitters.",
            "start_time": 89.45
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Study Acuña's baserunning technique - notice his explosive first step and minimal lead. His success rate against catchers demonstrates elite acceleration and read of pitcher's moves.",
            "start_time": 20.12
          },
          {
            "p": "Watch his pre-pitch setup on steal attempts - the slight weight shift, the timing of his secondary lead, and how he uses the pitcher's tempo against them. His success rate shows mastery of these fundamentals.",
            "start_time": 65.54
          },
          {
            "p": "The mechanics on that 461-foot home run are fascinating - perfect hip rotation, level swing plane, and optimal launch angle combining for maximum exit velocity. A masterclass in power hitting technique.",
            "start_time": 186.76
          },
          {
            "p": "His outfield defense showcases elite athleticism - the way he tracks the ball off the bat, takes efficient routes, and times his leap against the ivy shows advanced defensive instincts.",
            "start_time": 297.44
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "Watch Rodon's mechanics closely - his 96mph fastball delivery shows perfect balance and follow-through. The way he's commanding his pitches demonstrates elite-level control.",
            "start_time": 146.04
          },
          {
            "p": "Study Stanton's swing on that RBI double - notice the hip rotation and how he stays inside the ball. The way he drives it to the opposite field shows advanced hitting approach.",
            "start_time": 205.14
          },
          {
            "p": "Dominguez's baserunning technique on that stolen base is textbook - great jump, perfect slide, and excellent read of the pitcher's move.",
            "start_time": 263.12
          },
          {
            "p": "Gleyber's home run swing is a masterclass in hitting mechanics - watch how he keeps his hands inside and drives through the ball for opposite-field power.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "A fascinating debut for Samuel Aldegary, the first Italian-born MLB pitcher. Despite early struggles, his ability to adapt and settle down shows promising development potential - throwing 5 innings in his first start. Watch his pitch selection and mechanics, particularly how he adjusts after the challenging first inning.",
            "start_time": 24.12
          },
          {
            "p": "Taylor Ward continues to demonstrate his improved plate approach, launching a leadoff home run off George Kirby. His recent hot streak is evident in his 10-game hitting streak, and his ability to work counts is becoming a key asset for the Angels' lineup.",
            "start_time": 141.61
          },
          {
            "p": "Zach Neto's baserunning prowess is on full display with his 24th and 25th stolen bases of the season. His aggressive yet calculated approach on the basepaths, combined with his defensive skills (despite the two errors), shows why he's one of the most intriguing young talents to watch.",
            "start_time": 164.79
          },
          {
            "p": "Mickey Moniak and Brandon Drury showcase their power potential with back-to-back home runs. Drury's particularly impressive at-bat demonstrates his growth as a hitter, working the count before delivering the big hit. This kind of development in our players is exactly what makes player analysis so fascinating.",
            "start_time": 305.9
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "Yamamoto's pitch mechanics in the first inning demonstrate his elite adaptability. Watch how he adjusts his arm slot and release point after early command issues, particularly with his signature splitter. His ability to maintain consistent mechanics while varying pitch selection shows why he's one of baseball's most promising young talents.",
            "start_time": 24.12
          },
          {
            "p": "Shohei Ohtani's baserunning brilliance is on full display here. His first-step acceleration and elite sprint speed (measured at 29.8 ft/sec) turn a routine ground ball into a run-scoring play. Watch his perfect read of the defense and how he maintains optimal running angles - a masterclass in baserunning technique from one of baseball's most dynamic athletes.",
            "start_time": 126.08
          },
          {
            "p": "Gavin Lux's improvement against left-handed pitching is evident in this clutch double. Notice his refined bat path - keeping his hands inside and driving through the ball with improved hip rotation. His recent mechanical adjustments have resulted in a significant increase in opposite-field power, particularly against southpaws.",
            "start_time": 289.83
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "A fascinating strategic matchup between baseball's most storied franchises. The analytics tell an interesting story: the Dodgers' league-leading OPS+ against the Yankees' superior pitching WAR. Watch how both teams leverage their defensive positioning and pitch sequencing in high-leverage situations.",
            "start_time": 26.7
          },
          {
            "p": "The series showcases modern baseball's evolution: the Yankees' traditional power approach (top 3 in HR%) versus the Dodgers' balanced offense (MLB-best wRC+). Pay attention to how both teams adjust their defensive alignments based on spray charts and situational data.",
            "start_time": 96.14
          },
          {
            "p": "Fascinating to analyze the bullpen usage patterns - both teams are employing advanced metrics for matchup optimization. Note the strategic timing of pitching changes based on opposing batters' platoon splits and hard-hit rates in high-leverage situations.",
            "start_time": 199.08
          },
          {
            "p": "The series demonstrates how data-driven decision making shapes modern baseball. From pitch selection (notice the increased breaking ball usage in hitters' counts) to defensive positioning (watch the outfield depth adjustments), every aspect is influenced by advanced analytics.",
            "start_time": 324.70
          }
        ]
      }
    },
    "alex-martinez": {
      "img": "img/dodgers.jpg",
      "name": "Alex Martinez",
      "fan-type": "Casual Viewer",
      "description": "Background: General sports interest | Favourite Aspects: Exciting moments, highlights | Viewing Habits: Watches highlights, big games | Goals: Stay informed about major events",
      "favourite-aspect": "Exciting moments, highlights",
      "favorite-teams": "LA Dodgers",
      "favorite-players": "Freddie Freeman",
      "age": 44,
      "gender": "M",
      "location": "Los Angeles",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "Moderate",
      "minutes-watched-mlb-tv": "Low",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "Low",
      "season-ticket-holder": "Single Game Ticket Buyer",
      "family-with-kids": "Yes",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "Unbelievable scenes as the Dodgers complete the greatest comeback in World Series clinching game history! From down 5-0 to winning 7-6, this is what October magic is all about!",
            "start_time": 9.02
          },
          {
            "p": "The celebration erupts! Players rushing the field, fans going wild - this is what baseball dreams are made of! A comeback for the ages to win the World Series!",
            "start_time": 59.7
          },
          {
            "p": "The tension is electric as Verdugo steps in - the Yankees' last hope with the tying run at the plate! The crowd on their feet, holding their breath with every pitch!",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "What an atmosphere at Yankee Stadium! The crowd is absolutely electric as Soto crushes a three-run homer to send the Yankees to the World Series. The stadium's going crazy, and you can feel the excitement building for an epic Dodgers-Yankees showdown. These are the moments that make baseball so fun to watch with friends!",
            "start_time": 36.58
          },
          {
            "p": "Talk about entertainment! Judge and Chisholm Jr. put on a show with back-to-back homers that get everyone out of their seats. The energy in the stadium is off the charts - this is exactly why baseball's so much better when you're watching with a crowd. High-fives all around!",
            "start_time": 133.94
          },
          {
            "p": "The game's got everything you could want - incredible defensive plays, clutch hits, and the crowd going wild with every pitch. This is why you come to the ballpark! The playoff atmosphere is unreal - everyone's on their feet for every big moment.",
            "start_time": 326.23
          },
          {
            "p": "What a finish to an amazing series! The celebrations are wild as the Dodgers clinch it. From the players storming the field to the champagne showers in the clubhouse - this is what makes baseball so special. Perfect excuse to keep the party going with friends, whether you're a Dodgers fan or not!",
            "start_time": 481.71
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "You couldn't ask for a better matchup - Dodgers vs Yankees in the World Series! The atmosphere is incredible with both teams' fans packing the stadiums. Even if you're not a die-hard fan, you can feel the excitement in the air. Perfect time to grab some friends and catch the action!",
            "start_time": 26.7
          },
          {
            "p": "The star power in this series is unreal! Ohtani, Judge, Betts, Soto - it's like an All-Star Game every night. Whether you're a baseball expert or just here for the fun, these guys put on an amazing show. The crowd goes wild every time one of them steps up to the plate!",
            "start_time": 96.14
          },
          {
            "p": "The ballpark experience is everything here - from the classic stadium vibes to the crowd doing the wave. Hot dogs, cold drinks, and playoff baseball - doesn't get much better than this! Love seeing all the fans decked out in team gear, creating that perfect October atmosphere.",
            "start_time": 199.08
          },
          {
            "p": "These games are pure entertainment - home runs, diving catches, close plays at the plate! It's the kind of series that reminds you why baseball's so much fun to watch with friends. Every game has those 'did you see that?' moments that get everyone talking!",
            "start_time": 324.70
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "The crowd is absolutely buzzing for Game 5! Nothing beats playoff baseball at Yankee Stadium - the place is packed and everyone's ready for an epic night. Perfect game to be at with friends, especially with both teams' aces on the mound. The energy is just incredible!",
            "start_time": 18.0
          },
          {
            "p": "Talk about getting your money's worth - Judge and Chisholm go back-to-back! The whole stadium erupts, everyone's high-fiving strangers, and the roar when those balls clear the fence is deafening. These are the moments you'll be talking about at work tomorrow!",
            "start_time": 31.76
          },
          {
            "p": "The game's got everything you could want - Cole dealing on the mound, great defensive plays, and the crowd going wild with every pitch. This is why you come to the ballpark! The playoff atmosphere is unreal - everyone's on their feet for every big moment.",
            "start_time": 159.58
          },
          {
            "p": "Edge of your seat stuff in the late innings! The tension in the crowd is electric - every pitch feels huge. Whether you're a baseball expert or just here for fun, you can't beat this kind of entertainment. These are the games that make baseball so awesome to watch with friends!",
            "start_time": 722.57
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "The crowd erupts as Cole and Devers face off in a dramatic showdown! The tension is electric as Cora storms out to defend his player - this is what baseball rivalries are all about!",
            "start_time": 27.24
          },
          {
            "p": "What a moment as Stanton rips that double down the line! The fans are on their feet as Chisholm races around to score the game's first run!",
            "start_time": 205.14
          },
          {
            "p": "The stadium is buzzing as Dominguez shows off his speed with that stolen base! The excitement builds with every pitch in this classic Yankees-Red Sox battle!",
            "start_time": 263.12
          },
          {
            "p": "The Bronx faithful explode as Gleyber's home run sails into the right field seats! Another unforgettable moment in this historic rivalry!",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Oh my goodness, you have to see this! Acuña absolutely crushes this ball - the sound off the bat is insane! The whole crowd just goes 'Whoa!' when it leaves his bat. These are the kind of highlights you immediately text to your friends!",
            "start_time": 4.3
          },
          {
            "p": "470 feet?! That's not just a home run, that's a moonshot! The ball lands in the Hank Aaron Terrace, and everyone in the stadium is just in awe. Even if you're not a big baseball fan, you can appreciate how ridiculous this blast is!",
            "start_time": 25.8
          },
          {
            "p": "Check out the replay - the way the outfielder doesn't even move because he knows it's gone, the dugout's reaction, and the fans going wild! This is the kind of highlight that makes baseball so fun to watch. Perfect clip to show at your next watch party!",
            "start_time": 42.5
          },
          {
            "p": "Love seeing the crowd's reaction as they realize just how far this ball went. Everyone's phones are out recording it, and you can hear the buzz in the stadium. These are the moments that make you glad you came to the game - what an absolute blast!",
            "start_time": 57.0
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "An exciting rivalry game with plenty of dramatic moments! From Betts' leadoff homer to Freeman's three-run blast and a game-tying home run. The back-and-forth action and close finish make this a must-watch. The historic rivalry adds extra weight to every play in this intense matchup.",
            "start_time": 4.3
          },
          {
            "p": "The crowd is electric from the first pitch! You can feel the intensity of this historic rivalry in every at-bat!",
            "start_time": 24.12
          },
          {
            "p": "What a moment as Mookie launches one into the bleachers! The fans are going absolutely wild!",
            "start_time": 56.38
          },
          {
            "p": "The tension builds as Yamamoto works his magic - every strikeout gets a bigger roar from the crowd!",
            "start_time": 155.02
          },
          {
            "p": "That double play brings everyone to their feet! The energy in the stadium is incredible!",
            "start_time": 289.83
          },
          {
            "p": "The fans are loving every minute as the bullpen shuts it down! Another classic chapter in this amazing rivalry!",
            "start_time": 437.55
          }
        ]
      }
    },
    "emily-davis": {
      "img": "img/emily.jpg",
      "name": "Emily Davis",
      "fan-type": "Game Analyst",
      "description": "Background: Analytical mindset, often played baseball | Favourite Aspects: Strategy, game mechanics | Viewing Habits: Analyzes games, enjoys detailed commentary | Goals: Understand and appreciate game strategy",
      "favourite-aspect": "Strategy, game mechanics",
      "favorite-teams": null,
      "favorite-players": "Jacob deGrom, Max Fried",
      "age": 33,
      "gender": "F",
      "location": "Boston",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "High",
      "minutes-watched-mlb-tv": "High",
      "marital-status": "Single",
      "usd-spent-mlb-shop": "Low",
      "season-ticket-holder": "Half Season Ticket Member",
      "family-with-kids": "No",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "Fascinating defensive positioning for this final at-bat - notice how the Dodgers shift slightly towards pull-side against Verdugo, but maintain middle-depth outfield coverage given his 38% opposite-field contact rate this season. Every fielder's position is calibrated based on months of situational data.",
            "start_time": 9.02
          },
          {
            "p": "The pitch sequence here is masterful - Buehler sets up the out by establishing his cutter inside early in the count, then exploits Verdugo's tendency to chase breaking balls away when behind. His mechanics remain consistent despite pitching on short rest, maintaining his typical release point.",
            "start_time": 59.7
          },
          {
            "p": "Roberts' bullpen management proves decisive - using Buehler in relief breaks from convention but aligns with the data showing his superior numbers against left-handed hitters in high-leverage situations. The decision to warm up both Miller and Phillips simultaneously kept the Yankees' lineup decisions uncertain.",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "Soto's mechanics in that pivotal at-bat are textbook - his load timing perfectly synchronized with pitch recognition (0.21 seconds), and his hip rotation generating optimal torque (maximum angular velocity of 720°/sec). The Yankees' strategy of attacking him inside backfires as his pull-side power (.687 SLG on inside pitches) proves decisive. His plate discipline forces pitchers to work in the zone.",
            "start_time": 36.58
          },
          {
            "p": "The Dodgers' strategic adjustments against Cole prove decisive - after his dominant Game 1, they increase their first-pitch swing percentage from 23% to 41%, preventing him from establishing his preferred pitch sequencing. Watch how they specifically target his four-seamer up in the zone.",
            "start_time": 133.94
          },
          {
            "p": "Fascinating bullpen usage throughout - the Dodgers optimize their relief matchups based on batted ball profiles rather than traditional lefty-righty splits. Their relievers' combined ground ball rate (58%) neutralizes the Yankees' power-heavy approach, especially in late-game situations.",
            "start_time": 326.23
          },
          {
            "p": "The defensive metrics tell the complete story - the Dodgers' shifted alignment saves 4 runs above average, while their outfield positioning (+2.3 OAA) proves crucial. Notice how they adjust their defensive depth based on count leverage, particularly with runners in scoring position.",
            "start_time": 481.71
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "This matchup presents fascinating strategic contrasts in offensive philosophy - Yankees' power-centric approach (MLB-leading .483 SLG) versus Dodgers' contact-focused strategy (82.3% contact rate, lowest K%). The defensive alignments evolve throughout the series, with both teams adjusting their shifts based on spray chart tendencies and count leverage.",
            "start_time": 26.7
          },
          {
            "p": "The pitch selection data reveals compelling patterns - Yankees' staff heavily relies on elevated fastballs (42% usage above zone) while Dodgers counter with a diverse mix (no pitch type exceeding 30%). Watch how each team's approach evolves after the first time through the order, particularly with runners in scoring position.",
            "start_time": 89.32
          },
          {
            "p": "Base-running analytics become a critical factor - Dodgers' aggressive approach (+4.2 BsR) forces defensive adjustments, particularly with their optimal jump timing (1.3 seconds average). The Yankees counter by varying hold times and implementing a mix of slide-step deliveries, affecting their pitchers' effectiveness (-2.1% decrease in strike rate).",
            "start_time": 156.78
          },
          {
            "p": "Modern bullpen strategy on full display - high-leverage relievers deployed based on matchup data rather than traditional inning roles. The Dodgers' superior relief ERA (2.8) stems from optimal matchup exploitation and precise tunneling sequences, particularly evident in their right-handed relievers against left-handed power bats.",
            "start_time": 245.91
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "Cole's approach in the early innings is methodical - establishing his four-seam fastball (96.8 mph average) up in the zone while maintaining an optimal release point variance of just 0.8 inches. His pitch tunneling metrics (2.3 inches of separation at decision point) create deception between his fastball and slider.",
            "start_time": 18.0
          },
          {
            "p": "The game pivots on the Dodgers' third-inning adjustments - they increase their first-pitch swing rate against Cole from 27% to 44%, disrupting his typical sequencing patterns. Their average launch angle against his fastball rises from 12° to 18°, indicating a deliberate approach to counter his high-zone strategy.",
            "start_time": 159.58
          },
          {
            "p": "Roberts' bullpen deployment shows masterful leverage recognition - bringing in Miller (2.1 FIP vs LHH) to face the Yankees' left-handed power core in the sixth, then transitioning to Phillips whose sinker-slider combo generates a 63% ground ball rate against right-handed batters.",
            "start_time": 326.23
          },
          {
            "p": "Defensive positioning becomes crucial in late innings - the Dodgers' outfield alignment adjusts -12 feet deeper with Chapman at bat, respecting his 92.3 mph average exit velocity. The infield positioning with runners on base reflects detailed spray chart analysis, particularly evident in the critical 8th inning double play.",
            "start_time": 481.71
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Acuña's stolen base success rate of 100% against the Mets (20/20) significantly exceeds league average. His lead distance and acceleration metrics indicate optimal risk/reward calculation on steal attempts.",
            "start_time": 20.12
          },
          {
            "p": "Sprint speed analytics on his stolen bases average 30.2 ft/sec, placing him in the 99th percentile. His success rate correlates strongly with pitcher delivery times above 1.3 seconds.",
            "start_time": 65.54
          },
          {
            "p": "That 461-foot home run registered a 108.5 mph exit velocity with a 28-degree launch angle - nearly perfect optimization for maximum distance. His barrel rate on elevated fastballs shows marked improvement.",
            "start_time": 186.76
          },
          {
            "p": "His catch probability on the Wrigley play was just 35% based on distance covered and time to wall. His route efficiency of 98.2% and first-step reaction time of 0.4 seconds were both elite metrics.",
            "start_time": 297.44
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "Fascinating strategic dynamics in the Cole-Devers matchup. The intentional walk after the HBP incident shows a 15.3% increase in run expectancy, but Cora's reaction suggests deeper game theory implications.",
            "start_time": 27.24
          },
          {
            "p": "Rodon's pitch selection shows significant optimization - 96mph fastballs at the top of the zone yielding a 35% whiff rate, while his breaking balls generate 65% ground ball contact.",
            "start_time": 146.04
          },
          {
            "p": "Stanton's RBI double registered 108.5 mph exit velocity at a 25-degree launch angle - nearly optimal for extra-base hit probability in Yankee Stadium's dimensions.",
            "start_time": 205.14
          },
          {
            "p": "Gleyber's opposite-field home run demonstrates the benefits of the adjusted launch angle approach - 29 degrees with backspin creating optimal carry in the afternoon conditions.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "The Mariners' offensive approach against Aldegary showed textbook exploitation of a rookie pitcher's tendencies. They forced him into high-stress situations by extending at-bats (4.2 pitches per PA in the first inning) and capitalizing on his elevated release point when he worked from the stretch.",
            "start_time": 67.2
          },
          {
            "p": "Fascinating pitch sequencing from George Kirby, especially after the Ward home run. Notice how he adjusted his approach, increasing his breaking ball usage from 23% to 35% in subsequent innings, effectively keeping hitters off balance. His command metrics remained elite with a 68% first-pitch strike rate.",
            "start_time": 141.61
          },
          {
            "p": "Key defensive positioning shifts by Seattle's outfield throughout the game: Robles playing 15 feet shallower than league average against bottom-third hitters, while maintaining plus-15 feet depth against Ward and Moniak. This directly impacted two crucial plays in the 6th inning.",
            "start_time": 305.9
          },
          {
            "p": "Critical bullpen management by both teams in high-leverage situations. Seattle's decision to bring in Shaquan with runners on base deviated from their normal usage patterns, but the matchup metrics supported this move - he had a 68% ground ball rate against left-handed hitters in similar situations.",
            "start_time": 428.48
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "Yamamoto's first-inning approach shows calculated risk-taking - his splitter usage increases to 38% (up from season average 29%), exploiting the Giants' .198 wOBA against the pitch. His release point consistency (0.4 inch variance) creates effective pitch tunneling, particularly with the four-seam combo.",
            "start_time": 24.12
          },
          {
            "p": "The Giants' defensive strategy backfires against Betts - their +7 foot deeper outfield positioning, based on his 89.4 mph average exit velocity, proves insufficient against his optimized launch angle (27°). His first-pitch swing rate (42%) forces Webb to adjust his typical setup patterns.",
            "start_time": 155.02
          },
          {
            "p": "Fascinating middle-inning chess match - the Dodgers' bullpen deployment shows precise leverage index optimization (2.87 gmLI for high-stress situations). Phillips' appearance against the heart of the order yields a 68% whiff rate on breaking balls, well above his season average.",
            "start_time": 289.83
          },
          {
            "p": "Late-game defensive efficiency peaks with the Dodgers' 92.3% double play conversion rate (league average: 71%). Their infield positioning with runners on shows advanced spray chart implementation, creating -3.2 runs prevented through optimal alignment.",
            "start_time": 437.55
          }
        ]
      }
    },
    "chris-lee": {
      "img": "img/braves.jpg",
      "name": "Chris Lee",
      "fan-type": "Big Event Fan",
      "description": "Background: Enjoys spectacle and drama | Favourite Aspects: High-stakes games, records | Viewing Habits: Watches playoffs, All-Star games | Goals: Experience excitement of major events",
      "favourite-aspect": "High-stakes games, records",
      "favorite-teams": "Atlanta Braves",
      "favorite-players": "Ronald Acuña Jr.",
      "age": 19,
      "gender": "M",
      "location": "Chicago",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "Moderate",
      "minutes-watched-mlb-tv": "Low",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "Medium",
      "season-ticket-holder": "Single Game Ticket Buyer",
      "family-with-kids": "No",
      "highlights": {
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "This is the moment baseball fans dream about - Game 5 of the World Series, Dodgers looking to complete the greatest comeback in World Series clinching game history! Down 5-0 early, they've clawed back to take the lead. The tension in the stadium is electric as we're about to witness history!",
            "start_time": 9.02
          },
          {
            "p": "What a storyline - Walker Buehler, who fought back from Tommy John surgery, comes in to close out the biggest game of the year! The drama couldn't be higher as he faces Verdugo with the tying run at the plate. These are the moments that make October baseball legendary!",
            "start_time": 59.7
          },
          {
            "p": "The crowd erupts in pure pandemonium! The Dodgers have done it - completing one of the most incredible comebacks in World Series history! Ohtani gets his first championship, the Dodgers claim their eighth title, and we've just witnessed an instant classic that will be talked about for generations!",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "What a historic moment as Juan Soto launches a mammoth three-run blast into the Yankee Stadium night! The sound off the bat, the crowd going silent, and the Dodgers' dugout erupting - this is October baseball at its most dramatic! A defining moment in this epic Yankees-Dodgers World Series!",
            "start_time": 36.58
          },
          {
            "p": "The clash of titans continues as Gerrit Cole, the Yankees' $324-million ace, faces the mighty Dodgers lineup in a do-or-die situation! After his Game 1 masterpiece, can he repeat the magic? The electricity in baseball's cathedral is off the charts as two of MLB's most storied franchises battle for glory!",
            "start_time": 133.94
          },
          {
            "p": "Watch the Dodgers' bullpen take center stage in this instant classic! Every pitching change brings new drama as Roberts masterfully navigates the late innings. The tension builds with each out as we're witnessing one of the most tactically thrilling World Series games ever played!",
            "start_time": 326.23
          },
          {
            "p": "This is baseball theater at its finest! The Dodgers' defense makes play after spectacular play, each one bringing us closer to history. The infield shifts, the diving catches, the rocket throws - every moment feels like it could be the one that decides the championship!",
            "start_time": 481.71
          }
        ],
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "Baseball's dream matchup is finally here! The legendary Dodgers-Yankees rivalry writes its newest chapter as these iconic franchises clash for the first time in the Fall Classic since 1981! Two teams with 35 combined World Series titles - this is what October dreams are made of!",
            "start_time": 26.7
          },
          {
            "p": "The star power in this series is absolutely incredible! Ohtani, Judge, Betts, Soto - some of the biggest names in baseball colliding on its grandest stage! The electricity as these superstars face off in baseball's most historic ballparks will give you goosebumps!",
            "start_time": 96.14
          },
          {
            "p": "Every pitching matchup is must-see TV! Cole vs. Yamamoto, Glasnow vs. Rodon - these are the kind of legendary duels that define World Series history! The tension builds with every pitch as these aces battle for baseball immortality!",
            "start_time": 199.08
          },
          {
            "p": "The drama of this series is off the charts! From extra-inning thrillers to late-game heroics, we're watching an instant classic unfold! These moments will be replayed for generations as two of baseball's most storied franchises battle for ultimate glory!",
            "start_time": 324.70
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "The stage is set for an epic Game 5 showdown at Yankee Stadium! The electricity in the air is palpable as these two legendary franchises battle for baseball's ultimate prize! With the Dodgers one win away from glory, we're about to witness history in the making!",
            "start_time": 18.0
          },
          {
            "p": "What drama as the Yankees strike first! Judge's mammoth blast into Monument Park gives them an early 5-0 lead, and the Bronx is absolutely rocking! But remember - no lead is safe in October, especially with these resilient Dodgers!",
            "start_time": 156.32
          },
          {
            "p": "The comeback for the ages begins! Ohtani and Betts spark an incredible rally, chipping away at the lead! Every at-bat feels like a heavyweight punch as these titans trade blows in one of the most dramatic World Series games ever!",
            "start_time": 287.91
          },
          {
            "p": "Hold onto your seats - we're watching an instant classic! The Dodgers have stormed all the way back to take the lead! The tension is unbearable as Buehler comes in to try and close it out - this is the stuff baseball legends are made of!",
            "start_time": 445.23
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "What a start! Acuña sets the tone early with an electric stolen base that brings the crowd to their feet! His trademark speed and aggression on display as he takes second standing up!",
            "start_time": 20.12
          },
          {
            "p": "The anticipation builds as Acuña steps in - and BOOM! A towering blast to dead center! The raw power, the perfect swing, the signature bat flip - this is what baseball dreams are made of!",
            "start_time": 186.76
          },
          {
            "p": "An absolute web gem! Acuña races to the wall, times his leap perfectly, and robs a sure home run! The crowd goes wild as he shows why he's one of the most electrifying players in baseball!",
            "start_time": 297.44
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "The Cole-Devers confrontation recalls the fierce pitcher-batter rivalries of baseball's past, reminiscent of Gibson vs. Aaron or Clemens vs. Piazza. These moments define the Yankees-Red Sox legacy.",
            "start_time": 27.24
          },
          {
            "p": "Rodon's dominant pitching performance brings to mind the great Yankees-Red Sox duels of the past, where aces like Pedro Martinez and Roger Clemens would battle for supremacy.",
            "start_time": 146.04
          },
          {
            "p": "Stanton's clutch hitting continues the tradition of Yankees sluggers coming through in big moments against Boston, following in the footsteps of Mantle, Jackson, and O'Neill.",
            "start_time": 205.14
          },
          {
            "p": "Gleyber's opposite-field power shows how modern players are adapting to the historic dimensions of Yankee Stadium, just as lefty sluggers of the past took advantage of the short porch.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Witness an absolutely jaw-dropping display of raw power as Ronald Acuña Jr. launches a mammoth 470-foot home run that lands in the historic Hank Aaron Terrace! This is the kind of spectacular moment that baseball fans live for!",
            "start_time": 4.3
          },
          {
            "p": "In a crucial 3-1 count, Acuña demonstrates why he's one of baseball's most electrifying players, absolutely demolishing a high sinker for one of the longest home runs of the season. The sound off the bat and the immediate reaction tell you this is something special!",
            "start_time": 8.34
          },
          {
            "p": "The ball's trajectory into the Hank Aaron Terrace adds a layer of historical significance to this monster blast. When you're hitting balls to places named after baseball legends, you know you're witnessing something extraordinary!",
            "start_time": 15.5
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "A classic Dodgers-Giants rivalry game with high stakes! Multiple lead changes, clutch home runs, and dramatic defensive plays make this a must-watch. The historic rivalry adds extra weight to every play in this intense matchup.",
            "start_time": 4.3
          },
          {
            "p": "Mookie sets the tone early with that leadoff blast! Nothing better than taking it to the Giants right from the first inning!",
            "start_time": 24.12
          },
          {
            "p": "Yamamoto is dealing! That splitter is unhittable - Giants hitters looking completely lost at the plate. Worth every penny of that contract!",
            "start_time": 155.02
          },
          {
            "p": "Defense showing up big time - Lux and Smith turning that double play like they've been doing it for years. This team is so solid fundamentally!",
            "start_time": 289.83
          },
          {
            "p": "Bullpen shuts it down in classic Dodgers style. Another win against the Giants - this rivalry keeps getting better!",
            "start_time": 437.55
          },
          {
            "p": "Love seeing the Giants' frustration as they keep failing to solve Yamamoto. Our ace is showing why he's the best in the division!",
            "start_time": 520.79
          }
        ]
      }
    },
    "charles-harris": {
      "img": "img/yankees.jpg",
      "name": "Charles Harris",
      "fan-type": "Nostalgic Fan",
      "description": "Background: Grew up watching baseball's golden era | Favourite Aspects: Classic games, legendary players | Viewing Habits: Watches classic games, documentaries | Goals: Relive golden moments of baseball history",
      "favourite-aspect": "Classic games, legendary players",
      "favorite-teams": "NY Yankees",
      "favorite-players": "Aaron Judge, Gerrit Cole",
      "age": 58,
      "gender": "M",
      "location": "New York",
      "games-attended-2024": "Low",
      "games-watched-mlb-tv": "Moderate",
      "minutes-watched-mlb-tv": "Moderate",
      "marital-status": "Family",
      "usd-spent-mlb-shop": "Medium",
      "season-ticket-holder": "Half Season Ticket Member",
      "family-with-kids": "Yes",
      "highlights": {
        "Dodgers_vs_Yankees_World_Series": [
          {
            "p": "The Fall Classic returns to the Cathedral of Baseball for Game 3. These shadows stretching across the infield remind me of the golden age - when the Brooklyn Dodgers would make that fateful trip up to the Bronx to face our beloved Bombers. The electricity in the air hasn't changed since those classic matchups of the '50s.",
            "start_time": 26.7
          },
          {
            "p": "Freeman's home run stings, but it reminds me of how Duke Snider used to torment us in those old Subway Series. Though the names and faces change, the intensity of this Yankees-Dodgers rivalry remains just as fierce as it was when Yogi Berra was behind the plate and Jackie Robinson was stealing bases.",
            "start_time": 96.14
          },
          {
            "p": "Watching Judge step in against Buehler brings back memories of those epic at-bats between Mickey Mantle and Don Newcombe. The Stadium may be new, but that familiar October chill in the Bronx air takes me right back to when this matchup was an annual autumn ritual between baseball's greatest franchises.",
            "start_time": 199.08
          }
        ],
        "FINAL_OUT_The_Dodgers_win_the_2024_World_Series": [
          {
            "p": "As a lifelong Yankees fan who's witnessed countless October classics, watching Verdugo step into that box reminds me of the tension when Yogi Berra faced Don Newcombe in Game 7 of '56. The weight of Yankees history rests on every pitch in these moments.",
            "start_time": 0.0
          },
          {
            "p": "This heartbreaking 5-0 collapse echoes the pain of the '04 ALCS, though the Yankees' resilient spirit remains unchanged since the days of DiMaggio. The ghosts of Yankees past must be stirring in Monument Park, watching our modern-day warriors battle till the final out.",
            "start_time": 59.7
          },
          {
            "p": "Walker Buehler's heroic relief appearance, coming in on short rest, brings back memories of Whitey Ford's gutsy performances in the '61 Series. While the outcome stings for us Yankees faithful, this is the kind of classic baseball moment that makes our sport timeless.",
            "start_time": 140.63
          }
        ],
        "Dodgers_take_home_title_in_epic_5_games_vs_Yankees": [
          {
            "p": "Juan Soto's pennant-clinching homer for our Yankees brought back memories of Chris Chambliss in '76 and Bucky Dent in '78. The electricity in the stadium, the roar of the crowd - it was pure October baseball, just like the old days when Mantle and Maris patrolled these hallowed grounds.",
            "start_time": 0.0
          },
          {
            "p": "Watching Judge and Stanton in pinstripes reminds me of the power duos of our storied past - Gehrig and Ruth, Mantle and Maris. That Stantonian blast to take the lead had all the majesty of those towering shots that used to land in the old Stadium's monuments when they were still in play.",
            "start_time": 99.44
          },
          {
            "p": "This series against the Dodgers brings back the golden age - our 12th World Series matchup. Every pitch echoes the drama of Don Larsen's perfect game in '56, every play carries the weight of those classic Yankees-Dodgers battles when baseball truly was America's pastime. Though the outcome wasn't what we hoped for, the pride of wearing those pinstripes never fades.",
            "start_time": 326.23
          }
        ],
        "Dodgers_vs_Yankees_World_Series_Game_5": [
          {
            "p": "The electricity in the Bronx tonight reminds me of those classic Game 5s of the past - Bob Turley in '56, Ron Guidry in '77. Our ace Gerrit Cole takes the mound carrying the weight of Yankees history on his shoulders, just like the greats before him. The Stadium's alive with that familiar October magic.",
            "start_time": 0.0
          },
          {
            "p": "Aaron Judge's blast to right-center - pure Yankees power baseball! It brings back memories of Reggie Jackson in '77, the way the crowd erupted, the majesty of the moment. When Judge connects like that, he channels the spirit of those mighty Yankees sluggers of the past - Ruth, Gehrig, Mantle, all of them.",
            "start_time": 91.32
          },
          {
            "p": "Every pitch in this elimination game carries the weight of our 27 championships. Cole's determination on the mound reminds me of Whitey Ford in those pressure-packed games against the Dodgers. The pinstripes still represent excellence, just as they did when I first fell in love with this team decades ago.",
            "start_time": 272.52
          }
        ],
        "Ronald_Acuña_Jr": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Red_Sox_vs_Yankees": [
          {
            "p": "The Cole-Devers confrontation recalls the fierce pitcher-batter rivalries of baseball's past, reminiscent of Gibson vs. Aaron or Clemens vs. Piazza. These moments define the Yankees-Red Sox legacy.",
            "start_time": 27.24
          },
          {
            "p": "Rodon's dominant pitching performance brings to mind the great Yankees-Red Sox duels of the past, where aces like Pedro Martinez and Roger Clemens would battle for supremacy.",
            "start_time": 146.04
          },
          {
            "p": "Stanton's clutch hitting continues the tradition of Yankees sluggers coming through in big moments against Boston, following in the footsteps of Mantle, Jackson, and O'Neill.",
            "start_time": 205.14
          },
          {
            "p": "Gleyber's opposite-field power shows how modern players are adapting to the historic dimensions of Yankee Stadium, just as lefty sluggers of the past took advantage of the short porch.",
            "start_time": 447.3
          }
        ],
        "Mariners_vs_Angels": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "470_FEET_Ronald_Acuña_Jr_ABSOLUTELY_DEMOLISHED_this_baseball": [
          {
            "p": "Not relevant",
            "start_time": null
          }
        ],
        "Dodgers_vs_Giants_Highlights": [
          {
            "p": "A continuation of the historic Dodgers-Giants rivalry that dates back to their New York days. While the players have changed, the intensity of this classic West Coast rivalry remains as strong as ever.",
            "start_time": 4.3
          },
          {
            "p": "This rivalry adds another classic chapter - the 2,548th meeting between these storied franchises dates back to their New York roots.",
            "start_time": 24.12
          },
          {
            "p": "Yamamoto's performance reminiscent of Orel Hershiser's dominance against the Giants in the late 80s - same devastating splitter approach.",
            "start_time": 155.02
          },
          {
            "p": "The Lux-Smith double play combo showing shades of the Lopes-Russell partnership that anchored the infield in the 70s.",
            "start_time": 289.83
          },
          {
            "p": "This bullpen performance ranks among the best in the rivalry's history - echoes of the dominant relief corps from the 1965 pennant race.",
            "start_time": 437.55
          },
          {
            "p": "The defensive shifts and analytics-driven positioning show how far this rivalry has evolved from the pure gut-instinct days of Leo Durocher.",
            "start_time": 520.79
          }
        ]
      }
    }
  },

  "fan-schema": [
    {
      "Fan Type": "Die-hard Team Loyalist",
      "Age Range": "18-65",
      "Background": "Lifelong fan, often local",
      "Engagement Level": "High",
      "Favorite Aspects": "Team history, rivalries",
      "Viewing Habits": "Watches every game, attends live",
      "Goals": "Support team through thick and thin",
      "Challenges": "Managing emotions during losing seasons and finding highlights of every game",
      "No. of Games Attended (2024)": "10-25",
      "No. of Games Watched on MLB.TV": "100-162",
      "No. of Minutes Watched on MLB.TV": "1000-1500",
      "Family": "Family, Kids",
      "USD Spent on MLB Shop": "800-3,000",
      "Season Ticket Holder": "Full, Half, Quarter"
    },
    {
      "Fan Type": "Player Enthusiast",
      "Age Range": "15-45",
      "Background": "Follows player careers",
      "Engagement Level": "Medium to High",
      "Favorite Aspects": "Player stats, achievements",
      "Viewing Habits": "Watches games featuring favorite players",
      "Goals": "See favorite players succeed and break records",
      "Challenges": "Players changing teams or retiring, finding highlights for player performances",
      "No. of Games Attended (2024)": "3-12",
      "No. of Games Watched on MLB.TV": "40-100",
      "No. of Minutes Watched on MLB.TV": "500-800",
      "Family": "Single, Kids",
      "USD Spent on MLB Shop": "300-1,200",
      "Season Ticket Holder": "Quarter, Single"
    },
    {
      "Fan Type": "Casual Viewer",
      "Age Range": "25-50",
      "Background": "General sports interest",
      "Engagement Level": "Low",
      "Favorite Aspects": "Exciting moments, highlights",
      "Viewing Habits": "Watches highlights, big games",
      "Goals": "Stay informed about major events",
      "Challenges": "Keeping up with detailed game knowledge and finding concise highlights",
      "No. of Games Attended (2024)": "0-2",
      "No. of Games Watched on MLB.TV": "5-20",
      "No. of Minutes Watched on MLB.TV": "500-3,000",
      "Family": "Family, Single",
      "USD Spent on MLB Shop": "50-250",
      "Season Ticket Holder": "Single"
    },
    {
      "Fan Type": "Game Analyst",
      "Age Range": "30-60",
      "Background": "Analytical mindset, often played baseball",
      "Engagement Level": "Medium to High",
      "Favorite Aspects": "Strategy, game mechanics",
      "Viewing Habits": "Analyzes games, enjoys detailed commentary",
      "Goals": "Understand and appreciate game strategy",
      "Challenges": "Finding in-depth analysis and accessing highlights of strategic plays",
      "No. of Games Attended (2024)": "6-12",
      "No. of Games Watched on MLB.TV": "50-120",
      "No. of Minutes Watched on MLB.TV": "8,000-20,000",
      "Family": "Family, Single",
      "USD Spent on MLB Shop": "400-1,000",
      "Season Ticket Holder": "Half, Quarter"
    },
    {
      "Fan Type": "Big Event Fan",
      "Age Range": "20-55",
      "Background": "Enjoys spectacle and drama",
      "Engagement Level": "Low to Medium",
      "Favorite Aspects": "High-stakes games, records",
      "Viewing Habits": "Watches playoffs, All-Star games",
      "Goals": "Experience excitement of major events",
      "Challenges": "Missing out on regular season context and finding highlights conveying drama",
      "No. of Games Attended (2024)": "1-5",
      "No. of Games Watched on MLB.TV": "10-40",
      "No. of Minutes Watched on MLB.TV": "2,000-8,000",
      "Family": "Family, Single",
      "USD Spent on MLB Shop": "150-500",
      "Season Ticket Holder": "Single"
    },
    {
      "Fan Type": "Nostalgic Fan",
      "Age Range": "40-70",
      "Background": "Grew up watching baseball's golden era",
      "Engagement Level": "Medium",
      "Favorite Aspects": "Classic games, legendary players",
      "Viewing Habits": "Watches classic games, documentaries",
      "Goals": "Relive golden moments of baseball history",
      "Challenges": "Finding quality highlights of classic games and players from past eras",
      "No. of Games Attended (2024)": "0-3",
      "No. of Games Watched on MLB.TV": "5-15",
      "No. of Minutes Watched on MLB.TV": "500-4,000",
      "Family": "Family, Single",
      "USD Spent on MLB Shop": "100-400",
      "Season Ticket Holder": "Single"
    }
  ],
  "prompts": {
    "interests": "Given this information about a financial advisor, return a JSON object {\"interests\": \"...\"} containing comma-separated keywords they would be interested in when listening to a financial podcast.",
    "highlights": "Given this video transcript:\n\nTitle: ${title}\n${transcript_with_timing}\n\nWrite a few paragraphs for:\n\n${profile}\n\nExplain the implications for their investors and how they can leverage this information to maximize returns for their clients. Respond as JSON paragraphs with timing.\n\n```json\n[\n{\"p\": \"[firstname], this video can help your [clientele] about ...\",\"start_time\": ...},{\"p\": \"[insight 1]\",\"start_time\": ...},{\"p\": \"[insight 2]\",\"start_time\": ...},{\"p\": \"[insight 3]\",\"start_time\": ...},]"
  }
}
